{
  "transform_params" : {
    "data" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "bottom" : "data",
      "alpha" : 0.079780854284763336,
      "operation" : 3,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "",
      "top" : "data__fix__underflow_____mobilenet0_conv0_fwd",
      "type" : "elementwise",
      "name" : "mobilenet0_conv0_fwd__fix__underflow___",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu0_fwd",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "mobilenet0_conv0_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "data__fix__underflow_____mobilenet0_conv0_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv1_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu1_fwd",
      "blob_weights" : 7,
      "K" : 8,
      "blob_biases" : 5,
      "name" : "mobilenet0_conv1_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "mobilenet0_relu0_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv2_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu2_fwd",
      "blob_weights" : 11,
      "K" : 8,
      "blob_biases" : 9,
      "name" : "mobilenet0_conv2_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "mobilenet0_relu1_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv3_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu3_fwd",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "mobilenet0_conv3_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "mobilenet0_relu2_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv4_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu4_fwd",
      "blob_weights" : 19,
      "K" : 16,
      "blob_biases" : 17,
      "name" : "mobilenet0_conv4_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenet0_relu3_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv5_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu5_fwd",
      "blob_weights" : 23,
      "K" : 32,
      "blob_biases" : 21,
      "name" : "mobilenet0_conv5_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenet0_relu4_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv6_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu6_fwd",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "mobilenet0_conv6_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenet0_relu5_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv7_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu7_fwd",
      "blob_weights" : 31,
      "K" : 32,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "mobilenet0_conv7_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "mobilenet0_relu6_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv8_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu8_fwd",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "mobilenet0_conv8_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu7_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv9_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu9_fwd",
      "blob_weights" : 39,
      "K" : 64,
      "blob_biases" : 37,
      "name" : "mobilenet0_conv9_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu8_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv10_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu10_fwd",
      "blob_weights" : 43,
      "K" : 64,
      "blob_biases" : 41,
      "name" : "mobilenet0_conv10_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu9_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv11_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu11_fwd",
      "blob_weights" : 47,
      "K" : 64,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "mobilenet0_conv11_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu10_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv12_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu12_fwd",
      "blob_weights" : 51,
      "K" : 64,
      "blob_biases" : 49,
      "name" : "mobilenet0_conv12_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu11_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv13_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu13_fwd",
      "blob_weights" : 55,
      "K" : 128,
      "blob_biases" : 53,
      "name" : "mobilenet0_conv13_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu12_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv14_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu14_fwd",
      "blob_weights" : 59,
      "K" : 128,
      "blob_biases" : 57,
      "name" : "mobilenet0_conv14_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu13_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv15_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu15_fwd",
      "blob_weights" : 63,
      "K" : 128,
      "blob_biases" : 61,
      "name" : "mobilenet0_conv15_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu14_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv16_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu16_fwd",
      "blob_weights" : 67,
      "K" : 128,
      "blob_biases" : 65,
      "name" : "mobilenet0_conv16_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu15_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv17_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu17_fwd",
      "blob_weights" : 71,
      "K" : 128,
      "blob_biases" : 69,
      "name" : "mobilenet0_conv17_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu16_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv18_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu18_fwd",
      "blob_weights" : 75,
      "K" : 128,
      "blob_biases" : 73,
      "name" : "mobilenet0_conv18_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu17_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv19_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu19_fwd",
      "blob_weights" : 79,
      "K" : 128,
      "blob_biases" : 77,
      "name" : "mobilenet0_conv19_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu18_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv20_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu20_fwd",
      "blob_weights" : 83,
      "K" : 128,
      "blob_biases" : 81,
      "name" : "mobilenet0_conv20_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu19_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv21_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu21_fwd",
      "blob_weights" : 87,
      "K" : 128,
      "blob_biases" : 85,
      "name" : "mobilenet0_conv21_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu20_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv22_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu22_fwd",
      "blob_weights" : 91,
      "K" : 128,
      "blob_biases" : 89,
      "name" : "mobilenet0_conv22_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu21_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv23_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu23_fwd",
      "blob_weights" : 95,
      "K" : 128,
      "blob_biases" : 93,
      "stride_x" : 2,
      "name" : "mobilenet0_conv23_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "mobilenet0_relu22_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv24_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu24_fwd",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "name" : "mobilenet0_conv24_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu23_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv25_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "mobilenet0_relu25_fwd",
      "blob_weights" : 103,
      "K" : 256,
      "blob_biases" : 101,
      "name" : "mobilenet0_conv25_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu24_fwd",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "mobilenet0_conv26_fwd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "mobilenet0_relu26_fwd",
      "blob_weights" : 107,
      "K" : 256,
      "blob_biases" : 105,
      "name" : "mobilenet0_conv26_fwd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "mobilenet0_relu25_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c3_lateral",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "rf_c3_lateral_relu",
      "blob_weights" : 111,
      "K" : 256,
      "blob_biases" : 109,
      "name" : "rf_c3_lateral",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu26_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c3_det_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c3_det_conv1_bn",
      "blob_weights" : 115,
      "K" : 64,
      "blob_biases" : 113,
      "name" : "rf_c3_det_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "rf_c3_lateral_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c3_det_context_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c3_det_context_conv1_relu",
      "blob_weights" : 119,
      "K" : 64,
      "blob_biases" : 117,
      "name" : "rf_c3_det_context_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c3_lateral_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c3_det_context_conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c3_det_context_conv2_bn",
      "blob_weights" : 123,
      "K" : 16,
      "blob_biases" : 121,
      "name" : "rf_c3_det_context_conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c3_det_context_conv1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c3_det_context_conv3_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c3_det_context_conv3_1_relu",
      "blob_weights" : 127,
      "K" : 16,
      "blob_biases" : 125,
      "name" : "rf_c3_det_context_conv3_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c3_det_context_conv1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c3_det_context_conv3_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c3_det_context_conv3_2_bn",
      "blob_weights" : 131,
      "K" : 16,
      "blob_biases" : 129,
      "name" : "rf_c3_det_context_conv3_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c3_det_context_conv3_1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "rf_c3_det_concat",
      "top" : "rf_c3_det_concat",
      "type" : "concat",
      "name" : "rf_c3_det_concat",
      "bottom" : "rf_c3_det_conv1_bn,rf_c3_det_context_conv2_bn,rf_c3_det_context_conv3_2_bn"
    },
    {
      "bottom" : "rf_c3_det_concat",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "rf_c3_det_concat_relu",
      "top" : "rf_c3_det_concat_relu",
      "type" : "activation",
      "name" : "rf_c3_det_concat_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_cls_score_stride32",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_cls_score_stride32",
      "blob_weights" : 135,
      "K" : 64,
      "blob_biases" : 133,
      "name" : "face_rpn_cls_score_stride32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "rf_c3_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_bbox_pred_stride32",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_bbox_pred_stride32",
      "blob_weights" : 139,
      "K" : 64,
      "blob_biases" : 137,
      "name" : "face_rpn_bbox_pred_stride32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "rf_c3_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_landmark_pred_stride32",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_landmark_pred_stride32",
      "blob_weights" : 143,
      "K" : 64,
      "blob_biases" : 141,
      "name" : "face_rpn_landmark_pred_stride32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "rf_c3_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_lateral",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "rf_c2_lateral_relu",
      "blob_weights" : 147,
      "K" : 128,
      "blob_biases" : 145,
      "name" : "rf_c2_lateral",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu22_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "crop0",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "rf_c3_lateral_relu",
      "debug_info" : "rf_c3_upsampling",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "rf_c3_upsampling",
      "scaling_factor_y" : 2
    },
    {
      "bottom" : "rf_c2_lateral_relu,crop0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus0",
      "top" : "_plus0",
      "type" : "elementwise",
      "name" : "_plus0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_aggr",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c2_aggr_relu",
      "blob_weights" : 151,
      "K" : 64,
      "blob_biases" : 149,
      "name" : "rf_c2_aggr",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "_plus0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_det_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c2_det_conv1_bn",
      "blob_weights" : 155,
      "K" : 64,
      "blob_biases" : 153,
      "name" : "rf_c2_det_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "rf_c2_aggr_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_det_context_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c2_det_context_conv1_relu",
      "blob_weights" : 159,
      "K" : 64,
      "blob_biases" : 157,
      "name" : "rf_c2_det_context_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c2_aggr_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_det_context_conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c2_det_context_conv2_bn",
      "blob_weights" : 163,
      "K" : 16,
      "blob_biases" : 161,
      "name" : "rf_c2_det_context_conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c2_det_context_conv1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_det_context_conv3_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c2_det_context_conv3_1_relu",
      "blob_weights" : 167,
      "K" : 16,
      "blob_biases" : 165,
      "name" : "rf_c2_det_context_conv3_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c2_det_context_conv1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c2_det_context_conv3_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c2_det_context_conv3_2_bn",
      "blob_weights" : 171,
      "K" : 16,
      "blob_biases" : 169,
      "name" : "rf_c2_det_context_conv3_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c2_det_context_conv3_1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "rf_c2_det_concat",
      "top" : "rf_c2_det_concat",
      "type" : "concat",
      "name" : "rf_c2_det_concat",
      "bottom" : "rf_c2_det_conv1_bn,rf_c2_det_context_conv2_bn,rf_c2_det_context_conv3_2_bn"
    },
    {
      "bottom" : "rf_c2_det_concat",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "rf_c2_det_concat_relu",
      "top" : "rf_c2_det_concat_relu",
      "type" : "activation",
      "name" : "rf_c2_det_concat_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_cls_score_stride16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_cls_score_stride16",
      "blob_weights" : 175,
      "K" : 64,
      "blob_biases" : 173,
      "name" : "face_rpn_cls_score_stride16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "rf_c2_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_bbox_pred_stride16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_bbox_pred_stride16",
      "blob_weights" : 179,
      "K" : 64,
      "blob_biases" : 177,
      "name" : "face_rpn_bbox_pred_stride16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "rf_c2_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_landmark_pred_stride16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_landmark_pred_stride16",
      "blob_weights" : 183,
      "K" : 64,
      "blob_biases" : 181,
      "name" : "face_rpn_landmark_pred_stride16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "rf_c2_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_red_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "rf_c1_red_conv_relu",
      "blob_weights" : 187,
      "K" : 64,
      "blob_biases" : 185,
      "name" : "rf_c1_red_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "mobilenet0_relu10_fwd",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "top" : "crop1",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "rf_c2_aggr_relu",
      "debug_info" : "rf_c2_upsampling",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "rf_c2_upsampling",
      "scaling_factor_y" : 2
    },
    {
      "bottom" : "rf_c1_red_conv_relu,crop1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus1",
      "top" : "_plus1",
      "type" : "elementwise",
      "name" : "_plus1",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_aggr",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c1_aggr_relu",
      "blob_weights" : 191,
      "K" : 64,
      "blob_biases" : 189,
      "name" : "rf_c1_aggr",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "_plus1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_det_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c1_det_conv1_bn",
      "blob_weights" : 195,
      "K" : 64,
      "blob_biases" : 193,
      "name" : "rf_c1_det_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "rf_c1_aggr_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_det_context_conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c1_det_context_conv1_relu",
      "blob_weights" : 199,
      "K" : 64,
      "blob_biases" : 197,
      "name" : "rf_c1_det_context_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c1_aggr_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_det_context_conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c1_det_context_conv2_bn",
      "blob_weights" : 203,
      "K" : 16,
      "blob_biases" : 201,
      "name" : "rf_c1_det_context_conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c1_det_context_conv1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_det_context_conv3_1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c1_det_context_conv3_1_relu",
      "blob_weights" : 207,
      "K" : 16,
      "blob_biases" : 205,
      "name" : "rf_c1_det_context_conv3_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c1_det_context_conv1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "rf_c1_det_context_conv3_2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "rf_c1_det_context_conv3_2_bn",
      "blob_weights" : 211,
      "K" : 16,
      "blob_biases" : 209,
      "name" : "rf_c1_det_context_conv3_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "rf_c1_det_context_conv3_1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "rf_c1_det_concat",
      "top" : "rf_c1_det_concat",
      "type" : "concat",
      "name" : "rf_c1_det_concat",
      "bottom" : "rf_c1_det_conv1_bn,rf_c1_det_context_conv2_bn,rf_c1_det_context_conv3_2_bn"
    },
    {
      "bottom" : "rf_c1_det_concat",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "rf_c1_det_concat_relu",
      "top" : "rf_c1_det_concat_relu",
      "type" : "activation",
      "name" : "rf_c1_det_concat_relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_cls_score_stride8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_cls_score_stride8",
      "blob_weights" : 215,
      "K" : 64,
      "blob_biases" : 213,
      "name" : "face_rpn_cls_score_stride8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 4,
      "bottom" : "rf_c1_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_bbox_pred_stride8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_bbox_pred_stride8",
      "blob_weights" : 219,
      "K" : 64,
      "blob_biases" : 217,
      "name" : "face_rpn_bbox_pred_stride8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "rf_c1_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "face_rpn_landmark_pred_stride8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "face_rpn_landmark_pred_stride8",
      "blob_weights" : 223,
      "K" : 64,
      "blob_biases" : 221,
      "name" : "face_rpn_landmark_pred_stride8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "rf_c1_det_concat_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}