{
  "transform_params" : {
    "conv2d_1_input__0" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_1\/convolution:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_1\/Relu:0",
      "blob_weights" : 3,
      "K" : 1,
      "blob_biases" : 1,
      "name" : "conv2d_1\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv2d_1_input__0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_1\/MaxPool:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_1\/MaxPool:0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_1\/MaxPool:0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_1\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2\/convolution:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_2\/Relu:0",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "conv2d_2\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pooling2d_1\/MaxPool:0",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_2\/MaxPool:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_2\/MaxPool:0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_2\/MaxPool:0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_2\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_3\/convolution:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_3\/Relu:0",
      "blob_weights" : 11,
      "K" : 64,
      "blob_biases" : 9,
      "name" : "conv2d_3\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "max_pooling2d_2\/MaxPool:0",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_3\/MaxPool:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_3\/MaxPool:0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_3\/MaxPool:0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "activation_3\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "name" : "flatten_1\/Reshape:0",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 1,
      "bottom" : "max_pooling2d_3\/MaxPool:0",
      "debug_info" : "flatten_1\/Reshape:0",
      "dst_seq" : 1,
      "dst_k" : 1152,
      "top" : "flatten_1\/Reshape:0"
    },
    {
      "nB" : 1152,
      "top" : "activation_4\/Relu:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 15,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "flatten_1\/Reshape:0",
      "blob_biases" : 13,
      "has_tanh" : 0,
      "debug_info" : "dense_1\/MatMul",
      "name" : "dense_1\/MatMul",
      "has_prelu" : 0
    },
    {
      "nB" : 512,
      "top" : "activation_5\/Relu:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "activation_4\/Relu:0",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "debug_info" : "dense_2\/MatMul",
      "name" : "dense_2\/MatMul",
      "has_prelu" : 0
    },
    {
      "nB" : 512,
      "top" : "dense_3\/BiasAdd:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 1,
      "blob_weights" : 23,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "activation_5\/Relu:0",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "debug_info" : "dense_3\/MatMul",
      "name" : "dense_3\/MatMul",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_3\/BiasAdd:0",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "activation_6\/Sigmoid:0",
      "top" : "activation_6__Sigmoid__0",
      "type" : "activation",
      "name" : "activation_6\/Sigmoid:0",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}