{
  "transform_params" : {
    "data" : {
      "bias_a" : 0,
      "bias_g" : -0.99609375,
      "bias_r" : -0.99609375,
      "bias_b" : -0.99609375,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078125
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_1_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_1_relu",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "conv_1_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "data",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_2_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_2_dw_relu",
      "blob_weights" : 7,
      "K" : 8,
      "blob_biases" : 5,
      "name" : "conv_2_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "conv_1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_2_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_2_relu",
      "blob_weights" : 11,
      "K" : 8,
      "blob_biases" : 9,
      "name" : "conv_2_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "conv_2_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_3_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_3_dw_relu",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "conv_3_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "conv_2_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_3_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_3_relu",
      "blob_weights" : 19,
      "K" : 16,
      "blob_biases" : 17,
      "name" : "conv_3_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_3_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_4_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_4_dw_relu",
      "blob_weights" : 23,
      "K" : 32,
      "blob_biases" : 21,
      "name" : "conv_4_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_3_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_4_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_4_relu",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "conv_4_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_4_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_5_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_5_dw_relu",
      "blob_weights" : 31,
      "K" : 32,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "conv_5_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_4_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_5_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_5_relu",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "conv_5_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_5_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_6_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_6_dw_relu",
      "blob_weights" : 39,
      "K" : 64,
      "blob_biases" : 37,
      "name" : "conv_6_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_5_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_6_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_6_relu",
      "blob_weights" : 43,
      "K" : 64,
      "blob_biases" : 41,
      "name" : "conv_6_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_6_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_7_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_7_dw_relu",
      "blob_weights" : 47,
      "K" : 64,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "conv_7_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_6_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_7_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_7_relu",
      "blob_weights" : 51,
      "K" : 64,
      "blob_biases" : 49,
      "name" : "conv_7_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_7_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_8_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_8_dw_relu",
      "blob_weights" : 55,
      "K" : 128,
      "blob_biases" : 53,
      "name" : "conv_8_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_7_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_8_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_8_relu",
      "blob_weights" : 59,
      "K" : 128,
      "blob_biases" : 57,
      "name" : "conv_8_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_8_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_9_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_9_dw_relu",
      "blob_weights" : 63,
      "K" : 128,
      "blob_biases" : 61,
      "name" : "conv_9_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_8_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_9_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_9_relu",
      "blob_weights" : 67,
      "K" : 128,
      "blob_biases" : 65,
      "name" : "conv_9_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_9_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_10_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_10_dw_relu",
      "blob_weights" : 71,
      "K" : 128,
      "blob_biases" : 69,
      "name" : "conv_10_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_9_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_10_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_10_relu",
      "blob_weights" : 75,
      "K" : 128,
      "blob_biases" : 73,
      "name" : "conv_10_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_10_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_11_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_11_dw_relu",
      "blob_weights" : 79,
      "K" : 128,
      "blob_biases" : 77,
      "name" : "conv_11_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_10_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_11_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_11_relu",
      "blob_weights" : 83,
      "K" : 128,
      "blob_biases" : 81,
      "name" : "conv_11_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_11_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_12_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_12_dw_relu",
      "blob_weights" : 87,
      "K" : 128,
      "blob_biases" : 85,
      "name" : "conv_12_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_11_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_12_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_12_relu",
      "blob_weights" : 91,
      "K" : 128,
      "blob_biases" : 89,
      "name" : "conv_12_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_12_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_13_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_13_dw_relu",
      "blob_weights" : 95,
      "K" : 128,
      "blob_biases" : 93,
      "stride_x" : 2,
      "name" : "conv_13_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_12_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_13_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_13_relu",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "name" : "conv_13_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_13_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_14_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_14_dw_relu",
      "blob_weights" : 103,
      "K" : 256,
      "blob_biases" : 101,
      "name" : "conv_14_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_13_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_14_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_14_relu",
      "blob_weights" : 107,
      "K" : 256,
      "blob_biases" : 105,
      "name" : "conv_14_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_14_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "name" : "bn1",
      "bottom" : "conv_14_relu",
      "weights" : {

      },
      "debug_info" : "bn1",
      "top" : "bn1",
      "C" : 256,
      "blob_batchnorm_params" : 109,
      "type" : "batchnorm"
    },
    {
      "bottom" : "bn1",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "relu1",
      "top" : "relu1",
      "type" : "activation",
      "name" : "relu1"
    },
    {
      "pad_r" : 0,
      "debug_info" : "pool1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 5,
      "is_global" : 1,
      "top" : "pool1",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "pool1",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "relu1",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 5,
      "pad_value" : 0
    },
    {
      "bottom" : "pool1",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 0,
      "debug_info" : "flatten0",
      "top" : "flatten0",
      "type" : "flatten",
      "name" : "flatten0"
    },
    {
      "nB" : 256,
      "top" : "pre_fc1",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 128,
      "blob_weights" : 113,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "flatten0",
      "blob_biases" : 111,
      "has_tanh" : 0,
      "debug_info" : "pre_fc1",
      "name" : "pre_fc1",
      "has_prelu" : 0
    },
    {
      "name" : "fc1",
      "bottom" : "pre_fc1",
      "weights" : {

      },
      "debug_info" : "fc1",
      "top" : "fc1",
      "C" : 128,
      "blob_batchnorm_params" : 115,
      "type" : "batchnorm"
    },
    {
      "has_prelu" : 0,
      "top" : "fc2_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 7,
      "blob_weights" : 119,
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "fc1",
      "debug_info" : "fc2_output",
      "has_tanh" : 0,
      "blob_biases" : 117,
      "name" : "fc2_output",
      "nB" : 128
    }
  ]
}