{
  "transform_params" : {
    "input_1" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 1,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_80",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output32",
      "blob_weights" : 1,
      "K" : 3,
      "name" : "separable_conv2d_80",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 3,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 3,
      "bottom" : "input_1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_81",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_8\/Tanh:0",
      "blob_weights" : 5,
      "K" : 3,
      "blob_biases" : 3,
      "name" : "separable_conv2d_81",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "convolution_output32",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/activation_8\/Tanh:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/activation_8\/Tanh:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/activation_8\/Tanh:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/activation_8\/Tanh:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_90",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output28",
      "blob_weights" : 7,
      "K" : 16,
      "name" : "separable_conv2d_90",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "model_1\/activation_8\/Tanh:0_pooling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_91",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_9\/Tanh:0",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "separable_conv2d_91",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "convolution_output28",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_100",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output24",
      "blob_weights" : 13,
      "K" : 32,
      "name" : "separable_conv2d_100",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "model_1\/activation_9\/Tanh:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_101",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_10\/Tanh:0",
      "blob_weights" : 17,
      "K" : 32,
      "blob_biases" : 15,
      "name" : "separable_conv2d_101",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "convolution_output24",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/activation_10\/Tanh:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/activation_10\/Tanh:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/activation_10\/Tanh:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/activation_10\/Tanh:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_110",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output20",
      "blob_weights" : 19,
      "K" : 32,
      "name" : "separable_conv2d_110",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "model_1\/activation_10\/Tanh:0_pooling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_111",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_11\/Tanh:0",
      "blob_weights" : 23,
      "K" : 32,
      "blob_biases" : 21,
      "name" : "separable_conv2d_111",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "convolution_output20",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_120",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output16",
      "blob_weights" : 25,
      "K" : 64,
      "name" : "separable_conv2d_120",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "model_1\/activation_11\/Tanh:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_121",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_12\/Tanh:0",
      "blob_weights" : 29,
      "K" : 64,
      "blob_biases" : 27,
      "name" : "separable_conv2d_121",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "convolution_output16",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/activation_12\/Tanh:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/activation_12\/Tanh:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/activation_12\/Tanh:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/activation_12\/Tanh:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_130",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output12",
      "blob_weights" : 31,
      "K" : 64,
      "name" : "separable_conv2d_130",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "model_1\/activation_12\/Tanh:0_pooling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_131",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_13\/Tanh:0",
      "blob_weights" : 35,
      "K" : 64,
      "blob_biases" : 33,
      "name" : "separable_conv2d_131",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "convolution_output12",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_140",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output8",
      "blob_weights" : 37,
      "K" : 128,
      "name" : "separable_conv2d_140",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "model_1\/activation_13\/Tanh:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "separable_conv2d_141",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_14\/Tanh:0",
      "blob_weights" : 41,
      "K" : 128,
      "blob_biases" : 39,
      "name" : "separable_conv2d_141",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "convolution_output8",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "conv2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/conv2d_1\/Tanh:0",
      "blob_weights" : 45,
      "K" : 128,
      "blob_biases" : 43,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/activation_14\/Tanh:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/conv2d_1\/Tanh:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/conv2d_1\/Tanh:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/conv2d_1\/Tanh:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/conv2d_1\/Tanh:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "model_1\/conv2d_1\/Tanh:0_pooling0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/conv2d_1\/Tanh:0_transpose",
      "top" : "model_1\/conv2d_1\/Tanh:0_transpose0",
      "type" : "transpose",
      "name" : "model_1\/conv2d_1\/Tanh:0_transpose"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/conv2d_3\/Tanh:0",
      "blob_weights" : 49,
      "K" : 64,
      "blob_biases" : 47,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/activation_12\/Tanh:0_pooling0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/conv2d_3\/Tanh:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/conv2d_3\/Tanh:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/conv2d_3\/Tanh:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/conv2d_3\/Tanh:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "model_1\/conv2d_3\/Tanh:0_pooling0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/conv2d_3\/Tanh:0_transpose",
      "top" : "model_1\/conv2d_3\/Tanh:0_transpose0",
      "type" : "transpose",
      "name" : "model_1\/conv2d_3\/Tanh:0_transpose"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 1,
      "debug_info" : "conv2d_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/conv2d_5\/Tanh:0",
      "blob_weights" : 53,
      "K" : 32,
      "blob_biases" : 51,
      "name" : "conv2d_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/activation_10\/Tanh:0_pooling0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/conv2d_5\/Tanh:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/conv2d_5\/Tanh:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/conv2d_5\/Tanh:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/conv2d_5\/Tanh:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "model_1\/conv2d_5\/Tanh:0_pooling0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/conv2d_5\/Tanh:0_transpose",
      "top" : "model_1\/conv2d_5\/Tanh:0_transpose0",
      "type" : "transpose",
      "name" : "model_1\/conv2d_5\/Tanh:0_transpose"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output30",
      "blob_weights" : 55,
      "K" : 3,
      "name" : "separable_conv2d_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 3,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 3,
      "bottom" : "input_1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_1\/Relu:0",
      "blob_weights" : 59,
      "K" : 3,
      "blob_biases" : 57,
      "name" : "separable_conv2d_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "convolution_output30",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/activation_1\/Relu:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/activation_1\/Relu:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/activation_1\/Relu:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/activation_1\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output26",
      "blob_weights" : 61,
      "K" : 16,
      "name" : "separable_conv2d_20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 16,
      "bottom" : "model_1\/activation_1\/Relu:0_pooling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_21",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_2\/Relu:0",
      "blob_weights" : 65,
      "K" : 16,
      "blob_biases" : 63,
      "name" : "separable_conv2d_21",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "convolution_output26",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_30",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output22",
      "blob_weights" : 67,
      "K" : 32,
      "name" : "separable_conv2d_30",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "model_1\/activation_2\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_31",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_3\/Relu:0",
      "blob_weights" : 71,
      "K" : 32,
      "blob_biases" : 69,
      "name" : "separable_conv2d_31",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "convolution_output22",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/activation_3\/Relu:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/activation_3\/Relu:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/activation_3\/Relu:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/activation_3\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_40",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output18",
      "blob_weights" : 73,
      "K" : 32,
      "name" : "separable_conv2d_40",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "model_1\/activation_3\/Relu:0_pooling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_41",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_4\/Relu:0",
      "blob_weights" : 77,
      "K" : 32,
      "blob_biases" : 75,
      "name" : "separable_conv2d_41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "convolution_output18",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_50",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output14",
      "blob_weights" : 79,
      "K" : 64,
      "name" : "separable_conv2d_50",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "model_1\/activation_4\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_51",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_5\/Relu:0",
      "blob_weights" : 83,
      "K" : 64,
      "blob_biases" : 81,
      "name" : "separable_conv2d_51",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "convolution_output14",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/activation_5\/Relu:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/activation_5\/Relu:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/activation_5\/Relu:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/activation_5\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_60",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output10",
      "blob_weights" : 85,
      "K" : 64,
      "name" : "separable_conv2d_60",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "model_1\/activation_5\/Relu:0_pooling0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_61",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_6\/Relu:0",
      "blob_weights" : 89,
      "K" : 64,
      "blob_biases" : 87,
      "name" : "separable_conv2d_61",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "convolution_output10",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_70",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "convolution_output6",
      "blob_weights" : 91,
      "K" : 128,
      "name" : "separable_conv2d_70",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "model_1\/activation_6\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "separable_conv2d_71",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/activation_7\/Relu:0",
      "blob_weights" : 95,
      "K" : 128,
      "blob_biases" : 93,
      "name" : "separable_conv2d_71",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "convolution_output6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/conv2d_2\/Relu:0",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/activation_7\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/conv2d_2\/Relu:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/conv2d_2\/Relu:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/conv2d_2\/Relu:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/conv2d_2\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "model_1\/conv2d_2\/Relu:0_pooling0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/conv2d_2\/Relu:0_transpose",
      "top" : "model_1\/conv2d_2\/Relu:0_transpose0",
      "type" : "transpose",
      "name" : "model_1\/conv2d_2\/Relu:0_transpose"
    },
    {
      "bottom" : "model_1\/conv2d_1\/Tanh:0_transpose0,model_1\/conv2d_2\/Relu:0_transpose0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul2",
      "top" : "model_1\/multiply_1\/mul:0",
      "type" : "elementwise",
      "name" : "Mul2",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/multiply_1\/mul:0",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 0,
      "debug_info" : "flatten_1",
      "top" : "model_1\/flatten_1\/Reshape:0",
      "type" : "flatten",
      "name" : "flatten_1"
    },
    {
      "nB" : 1024,
      "top" : "model_1\/dense_1\/Tanh:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 103,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_1\/Reshape:0",
      "blob_biases" : 101,
      "has_tanh" : 1,
      "debug_info" : "dense_1",
      "name" : "dense_1",
      "has_prelu" : 0
    },
    {
      "nB" : 6,
      "top" : "biased_tensor_name7",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 107,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/dense_1\/Tanh:0",
      "blob_biases" : 105,
      "has_tanh" : 0,
      "debug_info" : "delta_s1",
      "name" : "delta_s1",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name7",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "Tanh5",
      "top" : "model_1\/delta_s1\/Tanh:01",
      "type" : "activation",
      "name" : "Tanh5",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "nB" : 1024,
      "top" : "model_1\/dense_2\/Tanh:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 111,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_1\/Reshape:0",
      "blob_biases" : 109,
      "has_tanh" : 1,
      "debug_info" : "dense_2",
      "name" : "dense_2",
      "has_prelu" : 0
    },
    {
      "nB" : 6,
      "top" : "biased_tensor_name6",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 115,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/dense_2\/Tanh:0",
      "blob_biases" : 113,
      "has_tanh" : 0,
      "debug_info" : "local_delta_stage1",
      "name" : "local_delta_stage1",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name6",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "Tanh4",
      "top" : "model_1\/local_delta_stage1\/Tanh:01",
      "type" : "activation",
      "name" : "Tanh4",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "nB" : 1024,
      "top" : "biased_tensor_name8",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 9,
      "blob_weights" : 119,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_1\/Reshape:0",
      "blob_biases" : 117,
      "has_tanh" : 0,
      "debug_info" : "dense_3",
      "name" : "dense_3",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name8",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Relu2",
      "top" : "model_1\/dense_3\/Relu:01",
      "type" : "activation",
      "name" : "Relu2",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/conv2d_4\/Relu:0",
      "blob_weights" : 123,
      "K" : 64,
      "blob_biases" : 121,
      "name" : "conv2d_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/activation_5\/Relu:0_pooling0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/conv2d_4\/Relu:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/conv2d_4\/Relu:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/conv2d_4\/Relu:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/conv2d_4\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "model_1\/conv2d_4\/Relu:0_pooling0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/conv2d_4\/Relu:0_transpose",
      "top" : "model_1\/conv2d_4\/Relu:0_transpose0",
      "type" : "transpose",
      "name" : "model_1\/conv2d_4\/Relu:0_transpose"
    },
    {
      "bottom" : "model_1\/conv2d_3\/Tanh:0_transpose0,model_1\/conv2d_4\/Relu:0_transpose0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul1",
      "top" : "model_1\/multiply_2\/mul:0",
      "type" : "elementwise",
      "name" : "Mul1",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/multiply_2\/mul:0",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 0,
      "debug_info" : "flatten_2",
      "top" : "model_1\/flatten_2\/Reshape:0",
      "type" : "flatten",
      "name" : "flatten_2"
    },
    {
      "nB" : 1024,
      "top" : "model_1\/dense_4\/Tanh:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 127,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_2\/Reshape:0",
      "blob_biases" : 125,
      "has_tanh" : 1,
      "debug_info" : "dense_4",
      "name" : "dense_4",
      "has_prelu" : 0
    },
    {
      "nB" : 6,
      "top" : "biased_tensor_name4",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 131,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/dense_4\/Tanh:0",
      "blob_biases" : 129,
      "has_tanh" : 0,
      "debug_info" : "delta_s2",
      "name" : "delta_s2",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name4",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "Tanh3",
      "top" : "model_1\/delta_s2\/Tanh:01",
      "type" : "activation",
      "name" : "Tanh3",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "nB" : 1024,
      "top" : "model_1\/dense_5\/Tanh:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 135,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_2\/Reshape:0",
      "blob_biases" : 133,
      "has_tanh" : 1,
      "debug_info" : "dense_5",
      "name" : "dense_5",
      "has_prelu" : 0
    },
    {
      "nB" : 6,
      "top" : "biased_tensor_name3",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 139,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/dense_5\/Tanh:0",
      "blob_biases" : 137,
      "has_tanh" : 0,
      "debug_info" : "local_delta_stage2",
      "name" : "local_delta_stage2",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name3",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "Tanh2",
      "top" : "model_1\/local_delta_stage2\/Tanh:01",
      "type" : "activation",
      "name" : "Tanh2",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "nB" : 1024,
      "top" : "biased_tensor_name5",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 9,
      "blob_weights" : 143,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_2\/Reshape:0",
      "blob_biases" : 141,
      "has_tanh" : 0,
      "debug_info" : "dense_6",
      "name" : "dense_6",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name5",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Relu1",
      "top" : "model_1\/dense_6\/Relu:01",
      "type" : "activation",
      "name" : "Relu1",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "model_1\/conv2d_6\/Relu:0",
      "blob_weights" : 147,
      "K" : 32,
      "blob_biases" : 145,
      "name" : "conv2d_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "model_1\/activation_3\/Relu:0_pooling0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "model_1\/conv2d_6\/Relu:0_pooling",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "model_1\/conv2d_6\/Relu:0_pooling0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "model_1\/conv2d_6\/Relu:0_pooling",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "model_1\/conv2d_6\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "model_1\/conv2d_6\/Relu:0_pooling0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "model_1\/conv2d_6\/Relu:0_transpose",
      "top" : "model_1\/conv2d_6\/Relu:0_transpose0",
      "type" : "transpose",
      "name" : "model_1\/conv2d_6\/Relu:0_transpose"
    },
    {
      "bottom" : "model_1\/conv2d_5\/Tanh:0_transpose0,model_1\/conv2d_6\/Relu:0_transpose0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "Mul",
      "top" : "model_1\/multiply_3\/mul:0",
      "type" : "elementwise",
      "name" : "Mul",
      "beta" : 0
    },
    {
      "bottom" : "model_1\/multiply_3\/mul:0",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 0,
      "debug_info" : "flatten_3",
      "top" : "model_1\/flatten_3\/Reshape:0",
      "type" : "flatten",
      "name" : "flatten_3"
    },
    {
      "nB" : 4096,
      "top" : "model_1\/dense_7\/Tanh:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 151,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_3\/Reshape:0",
      "blob_biases" : 149,
      "has_tanh" : 1,
      "debug_info" : "dense_7",
      "name" : "dense_7",
      "has_prelu" : 0
    },
    {
      "nB" : 6,
      "top" : "biased_tensor_name1",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 155,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/dense_7\/Tanh:0",
      "blob_biases" : 153,
      "has_tanh" : 0,
      "debug_info" : "delta_s3",
      "name" : "delta_s3",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name1",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "Tanh1",
      "top" : "model_1\/delta_s3\/Tanh:01",
      "type" : "activation",
      "name" : "Tanh1",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "nB" : 4096,
      "top" : "model_1\/dense_8\/Tanh:0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 6,
      "blob_weights" : 159,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_3\/Reshape:0",
      "blob_biases" : 157,
      "has_tanh" : 1,
      "debug_info" : "dense_8",
      "name" : "dense_8",
      "has_prelu" : 0
    },
    {
      "nB" : 6,
      "top" : "biased_tensor_name",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 3,
      "blob_weights" : 163,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/dense_8\/Tanh:0",
      "blob_biases" : 161,
      "has_tanh" : 0,
      "debug_info" : "local_delta_stage3",
      "name" : "local_delta_stage3",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name",
      "weights" : {

      },
      "mode" : 1,
      "debug_info" : "Tanh",
      "top" : "model_1\/local_delta_stage3\/Tanh:01",
      "type" : "activation",
      "name" : "Tanh",
      "attributes" : {
        "is_output" : 1
      }
    },
    {
      "nB" : 4096,
      "top" : "biased_tensor_name2",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 9,
      "blob_weights" : 167,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "model_1\/flatten_3\/Reshape:0",
      "blob_biases" : 165,
      "has_tanh" : 0,
      "debug_info" : "dense_9",
      "name" : "dense_9",
      "has_prelu" : 0
    },
    {
      "bottom" : "biased_tensor_name2",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Relu",
      "top" : "model_1\/dense_9\/Relu:01",
      "type" : "activation",
      "name" : "Relu",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}