{
  "transform_params" : {
    "data" : {
      "bias_a" : 0,
      "bias_g" : -0.99609375,
      "bias_r" : -0.99609375,
      "bias_b" : -0.99609375,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078125
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_1_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_1_relu",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv_1_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "data",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv_2_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv_2_dw_relu",
      "blob_weights" : 7,
      "K" : 64,
      "blob_biases" : 5,
      "name" : "conv_2_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_1_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "dconv_23_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dconv_23_conv_sep_relu",
      "blob_weights" : 11,
      "K" : 64,
      "blob_biases" : 9,
      "name" : "dconv_23_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_2_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "dconv_23_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "dconv_23_conv_dw_relu",
      "blob_weights" : 15,
      "K" : 128,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "dconv_23_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "dconv_23_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "dconv_23_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dconv_23_conv_proj_conv2d",
      "blob_weights" : 19,
      "K" : 128,
      "blob_biases" : 17,
      "name" : "dconv_23_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "dconv_23_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block0_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block0_conv_sep_relu",
      "blob_weights" : 23,
      "K" : 64,
      "blob_biases" : 21,
      "name" : "res_3_block0_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "dconv_23_conv_proj_conv2d",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block0_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block0_conv_dw_relu",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "res_3_block0_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block0_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block0_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block0_conv_proj_conv2d",
      "blob_weights" : 31,
      "K" : 128,
      "blob_biases" : 29,
      "name" : "res_3_block0_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block0_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block0_conv_proj_conv2d,dconv_23_conv_proj_conv2d",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus0",
      "top" : "_plus0",
      "type" : "elementwise",
      "name" : "_plus0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block1_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block1_conv_sep_relu",
      "blob_weights" : 35,
      "K" : 64,
      "blob_biases" : 33,
      "name" : "res_3_block1_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block1_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block1_conv_dw_relu",
      "blob_weights" : 39,
      "K" : 128,
      "blob_biases" : 37,
      "name" : "res_3_block1_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block1_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block1_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block1_conv_proj_conv2d",
      "blob_weights" : 43,
      "K" : 128,
      "blob_biases" : 41,
      "name" : "res_3_block1_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block1_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block1_conv_proj_conv2d,_plus0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus1",
      "top" : "_plus1",
      "type" : "elementwise",
      "name" : "_plus1",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block2_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block2_conv_sep_relu",
      "blob_weights" : 47,
      "K" : 64,
      "blob_biases" : 45,
      "name" : "res_3_block2_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block2_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block2_conv_dw_relu",
      "blob_weights" : 51,
      "K" : 128,
      "blob_biases" : 49,
      "name" : "res_3_block2_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block2_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block2_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block2_conv_proj_conv2d",
      "blob_weights" : 55,
      "K" : 128,
      "blob_biases" : 53,
      "name" : "res_3_block2_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block2_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block2_conv_proj_conv2d,_plus1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus2",
      "top" : "_plus2",
      "type" : "elementwise",
      "name" : "_plus2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block3_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block3_conv_sep_relu",
      "blob_weights" : 59,
      "K" : 64,
      "blob_biases" : 57,
      "name" : "res_3_block3_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus2",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block3_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block3_conv_dw_relu",
      "blob_weights" : 63,
      "K" : 128,
      "blob_biases" : 61,
      "name" : "res_3_block3_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block3_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block3_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block3_conv_proj_conv2d",
      "blob_weights" : 67,
      "K" : 128,
      "blob_biases" : 65,
      "name" : "res_3_block3_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block3_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block3_conv_proj_conv2d,_plus2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus3",
      "top" : "_plus3",
      "type" : "elementwise",
      "name" : "_plus3",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block4_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block4_conv_sep_relu",
      "blob_weights" : 71,
      "K" : 64,
      "blob_biases" : 69,
      "name" : "res_3_block4_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block4_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block4_conv_dw_relu",
      "blob_weights" : 75,
      "K" : 128,
      "blob_biases" : 73,
      "name" : "res_3_block4_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block4_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block4_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block4_conv_proj_conv2d",
      "blob_weights" : 79,
      "K" : 128,
      "blob_biases" : 77,
      "name" : "res_3_block4_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block4_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block4_conv_proj_conv2d,_plus3",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus4",
      "top" : "_plus4",
      "type" : "elementwise",
      "name" : "_plus4",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block5_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block5_conv_sep_relu",
      "blob_weights" : 83,
      "K" : 64,
      "blob_biases" : 81,
      "name" : "res_3_block5_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus4",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block5_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block5_conv_dw_relu",
      "blob_weights" : 87,
      "K" : 128,
      "blob_biases" : 85,
      "name" : "res_3_block5_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block5_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block5_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block5_conv_proj_conv2d",
      "blob_weights" : 91,
      "K" : 128,
      "blob_biases" : 89,
      "name" : "res_3_block5_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block5_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block5_conv_proj_conv2d,_plus4",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus5",
      "top" : "_plus5",
      "type" : "elementwise",
      "name" : "_plus5",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block6_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block6_conv_sep_relu",
      "blob_weights" : 95,
      "K" : 64,
      "blob_biases" : 93,
      "name" : "res_3_block6_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus5",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block6_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block6_conv_dw_relu",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "name" : "res_3_block6_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block6_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block6_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block6_conv_proj_conv2d",
      "blob_weights" : 103,
      "K" : 128,
      "blob_biases" : 101,
      "name" : "res_3_block6_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block6_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block6_conv_proj_conv2d,_plus5",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus6",
      "top" : "_plus6",
      "type" : "elementwise",
      "name" : "_plus6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block7_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block7_conv_sep_relu",
      "blob_weights" : 107,
      "K" : 64,
      "blob_biases" : 105,
      "name" : "res_3_block7_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block7_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block7_conv_dw_relu",
      "blob_weights" : 111,
      "K" : 128,
      "blob_biases" : 109,
      "name" : "res_3_block7_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block7_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block7_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block7_conv_proj_conv2d",
      "blob_weights" : 115,
      "K" : 128,
      "blob_biases" : 113,
      "name" : "res_3_block7_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block7_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block7_conv_proj_conv2d,_plus6",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus7",
      "top" : "_plus7",
      "type" : "elementwise",
      "name" : "_plus7",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block8_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block8_conv_sep_relu",
      "blob_weights" : 119,
      "K" : 64,
      "blob_biases" : 117,
      "name" : "res_3_block8_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "_plus7",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block8_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_3_block8_conv_dw_relu",
      "blob_weights" : 123,
      "K" : 128,
      "blob_biases" : 121,
      "name" : "res_3_block8_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_3_block8_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_3_block8_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_3_block8_conv_proj_conv2d",
      "blob_weights" : 127,
      "K" : 128,
      "blob_biases" : 125,
      "name" : "res_3_block8_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "res_3_block8_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_3_block8_conv_proj_conv2d,_plus7",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus8",
      "top" : "_plus8",
      "type" : "elementwise",
      "name" : "_plus8",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "dconv_34_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dconv_34_conv_sep_relu",
      "blob_weights" : 131,
      "K" : 64,
      "blob_biases" : 129,
      "name" : "dconv_34_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus8",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "dconv_34_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "dconv_34_conv_dw_relu",
      "blob_weights" : 135,
      "K" : 256,
      "blob_biases" : 133,
      "stride_x" : 2,
      "name" : "dconv_34_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "dconv_34_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "dconv_34_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "dconv_34_conv_proj_conv2d",
      "blob_weights" : 139,
      "K" : 256,
      "blob_biases" : 137,
      "name" : "dconv_34_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "dconv_34_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block0_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block0_conv_sep_relu",
      "blob_weights" : 143,
      "K" : 128,
      "blob_biases" : 141,
      "name" : "res_4_block0_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "dconv_34_conv_proj_conv2d",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block0_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block0_conv_dw_relu",
      "blob_weights" : 147,
      "K" : 256,
      "blob_biases" : 145,
      "name" : "res_4_block0_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block0_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block0_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block0_conv_proj_conv2d",
      "blob_weights" : 151,
      "K" : 256,
      "blob_biases" : 149,
      "name" : "res_4_block0_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block0_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block0_conv_proj_conv2d,dconv_34_conv_proj_conv2d",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus9",
      "top" : "_plus9",
      "type" : "elementwise",
      "name" : "_plus9",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block1_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block1_conv_sep_relu",
      "blob_weights" : 155,
      "K" : 128,
      "blob_biases" : 153,
      "name" : "res_4_block1_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus9",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block1_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block1_conv_dw_relu",
      "blob_weights" : 159,
      "K" : 256,
      "blob_biases" : 157,
      "name" : "res_4_block1_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block1_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block1_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block1_conv_proj_conv2d",
      "blob_weights" : 163,
      "K" : 256,
      "blob_biases" : 161,
      "name" : "res_4_block1_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block1_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block1_conv_proj_conv2d,_plus9",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus10",
      "top" : "_plus10",
      "type" : "elementwise",
      "name" : "_plus10",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block2_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block2_conv_sep_relu",
      "blob_weights" : 167,
      "K" : 128,
      "blob_biases" : 165,
      "name" : "res_4_block2_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus10",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block2_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block2_conv_dw_relu",
      "blob_weights" : 171,
      "K" : 256,
      "blob_biases" : 169,
      "name" : "res_4_block2_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block2_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block2_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block2_conv_proj_conv2d",
      "blob_weights" : 175,
      "K" : 256,
      "blob_biases" : 173,
      "name" : "res_4_block2_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block2_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block2_conv_proj_conv2d,_plus10",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus11",
      "top" : "_plus11",
      "type" : "elementwise",
      "name" : "_plus11",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block3_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block3_conv_sep_relu",
      "blob_weights" : 179,
      "K" : 128,
      "blob_biases" : 177,
      "name" : "res_4_block3_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus11",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block3_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block3_conv_dw_relu",
      "blob_weights" : 183,
      "K" : 256,
      "blob_biases" : 181,
      "name" : "res_4_block3_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block3_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block3_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block3_conv_proj_conv2d",
      "blob_weights" : 187,
      "K" : 256,
      "blob_biases" : 185,
      "name" : "res_4_block3_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block3_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block3_conv_proj_conv2d,_plus11",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus12",
      "top" : "_plus12",
      "type" : "elementwise",
      "name" : "_plus12",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block4_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block4_conv_sep_relu",
      "blob_weights" : 191,
      "K" : 128,
      "blob_biases" : 189,
      "name" : "res_4_block4_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus12",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block4_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block4_conv_dw_relu",
      "blob_weights" : 195,
      "K" : 256,
      "blob_biases" : 193,
      "name" : "res_4_block4_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block4_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block4_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block4_conv_proj_conv2d",
      "blob_weights" : 199,
      "K" : 256,
      "blob_biases" : 197,
      "name" : "res_4_block4_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block4_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block4_conv_proj_conv2d,_plus12",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus13",
      "top" : "_plus13",
      "type" : "elementwise",
      "name" : "_plus13",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block5_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block5_conv_sep_relu",
      "blob_weights" : 203,
      "K" : 128,
      "blob_biases" : 201,
      "name" : "res_4_block5_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus13",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block5_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block5_conv_dw_relu",
      "blob_weights" : 207,
      "K" : 256,
      "blob_biases" : 205,
      "name" : "res_4_block5_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block5_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block5_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block5_conv_proj_conv2d",
      "blob_weights" : 211,
      "K" : 256,
      "blob_biases" : 209,
      "name" : "res_4_block5_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block5_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block5_conv_proj_conv2d,_plus13",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus14",
      "top" : "_plus14",
      "type" : "elementwise",
      "name" : "_plus14",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block6_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block6_conv_sep_relu",
      "blob_weights" : 215,
      "K" : 128,
      "blob_biases" : 213,
      "name" : "res_4_block6_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus14",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block6_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block6_conv_dw_relu",
      "blob_weights" : 219,
      "K" : 256,
      "blob_biases" : 217,
      "name" : "res_4_block6_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block6_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block6_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block6_conv_proj_conv2d",
      "blob_weights" : 223,
      "K" : 256,
      "blob_biases" : 221,
      "name" : "res_4_block6_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block6_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block6_conv_proj_conv2d,_plus14",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus15",
      "top" : "_plus15",
      "type" : "elementwise",
      "name" : "_plus15",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block7_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block7_conv_sep_relu",
      "blob_weights" : 227,
      "K" : 128,
      "blob_biases" : 225,
      "name" : "res_4_block7_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus15",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block7_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block7_conv_dw_relu",
      "blob_weights" : 231,
      "K" : 256,
      "blob_biases" : 229,
      "name" : "res_4_block7_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block7_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block7_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block7_conv_proj_conv2d",
      "blob_weights" : 235,
      "K" : 256,
      "blob_biases" : 233,
      "name" : "res_4_block7_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block7_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block7_conv_proj_conv2d,_plus15",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus16",
      "top" : "_plus16",
      "type" : "elementwise",
      "name" : "_plus16",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block8_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block8_conv_sep_relu",
      "blob_weights" : 239,
      "K" : 128,
      "blob_biases" : 237,
      "name" : "res_4_block8_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus16",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block8_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block8_conv_dw_relu",
      "blob_weights" : 243,
      "K" : 256,
      "blob_biases" : 241,
      "name" : "res_4_block8_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block8_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block8_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block8_conv_proj_conv2d",
      "blob_weights" : 247,
      "K" : 256,
      "blob_biases" : 245,
      "name" : "res_4_block8_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block8_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block8_conv_proj_conv2d,_plus16",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus17",
      "top" : "_plus17",
      "type" : "elementwise",
      "name" : "_plus17",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block9_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block9_conv_sep_relu",
      "blob_weights" : 251,
      "K" : 128,
      "blob_biases" : 249,
      "name" : "res_4_block9_conv_sep_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "_plus17",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block9_conv_dw_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "res_4_block9_conv_dw_relu",
      "blob_weights" : 255,
      "K" : 256,
      "blob_biases" : 253,
      "name" : "res_4_block9_conv_dw_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "res_4_block9_conv_sep_relu",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block9_conv_proj_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block9_conv_proj_conv2d",
      "blob_weights" : 259,
      "K" : 256,
      "blob_biases" : 257,
      "name" : "res_4_block9_conv_proj_conv2d",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "res_4_block9_conv_dw_relu",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "res_4_block9_conv_proj_conv2d,_plus17",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_plus18",
      "top" : "_plus18",
      "type" : "elementwise",
      "name" : "_plus18",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "res_4_block10_conv_sep_conv2d",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "res_4_block10_conv_sep_relu",
      "blob_weights" : 263,
      "K" : 128,
      "blob_biases" : 261,
      "name" : "res_4_block10_conv_sep_conv2d",
