{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.4",
      "blob_weights" : 3,
      "K" : 1,
      "blob_biases" : 1,
      "name" : "input.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input_1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.5",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.7",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "input.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.4",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.8",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.10",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "input.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.7",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "input.11",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.11",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "input.10",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.12",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.14",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "name" : "input.12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.11",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.15",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.17",
      "blob_weights" : 19,
      "K" : 32,
      "blob_biases" : 17,
      "name" : "input.15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.14",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.18",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.20",
      "blob_weights" : 23,
      "K" : 32,
      "blob_biases" : 21,
      "name" : "input.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.17",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.21",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "input.21",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.21",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "input.20",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.22",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.24",
      "blob_weights" : 27,
      "K" : 32,
      "blob_biases" : 25,
      "name" : "input.22",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.21",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.25",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.27",
      "blob_weights" : 31,
      "K" : 32,
      "blob_biases" : 29,
      "name" : "input.25",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.24",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.28",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.30",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "input.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.27",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.31",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.33",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "name" : "input.31",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.30",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.34",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.36",
      "blob_weights" : 43,
      "K" : 32,
      "blob_biases" : 41,
      "name" : "input.34",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.33",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.37",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.39",
      "blob_weights" : 47,
      "K" : 32,
      "blob_biases" : 45,
      "name" : "input.37",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.36",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.40",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out.1",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "input.40",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.39",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.36,out.1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.41",
      "top" : "input.41",
      "type" : "elementwise",
      "name" : "input.41",
      "beta" : 0
    },
    {
      "bottom" : "input.41",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "x",
      "top" : "x",
      "type" : "activation",
      "name" : "x"
    },
    {
      "pad_r" : 0,
      "debug_info" : "289",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 28,
      "is_global" : 1,
      "top" : "289",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "289",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "x",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 28,
      "pad_value" : 0
    },
    {
      "name" : "input.42",
      "weights" : {

      },
      "dst_w" : 32,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "289",
      "debug_info" : "input.42",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "input.42"
    },
    {
      "nB" : 32,
      "top" : "input.44",
      "has_biases" : 0,
      "weights" : {

      },
      "nC" : 32,
      "blob_weights" : 53,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "input.42",
      "debug_info" : "input.43",
      "has_tanh" : 0,
      "name" : "input.43",
      "has_prelu" : 0
    },
    {
      "nB" : 32,
      "top" : "input.45",
      "has_biases" : 0,
      "weights" : {

      },
      "nC" : 32,
      "blob_weights" : 55,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.44",
      "debug_info" : "input.45",
      "has_tanh" : 0,
      "name" : "input.45",
      "has_prelu" : 0
    },
    {
      "bottom" : "input.45",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "297",
      "top" : "297",
      "type" : "activation",
      "name" : "297"
    },
    {
      "name" : "y",
      "weights" : {

      },
      "dst_w" : 1,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "297",
      "debug_info" : "y",
      "dst_seq" : 1,
      "dst_k" : 32,
      "top" : "y"
    },
    {
      "name" : "300",
      "bottom" : "y",
      "dst_n" : 1,
      "dst_seq" : 1,
      "weights" : {

      },
      "dst_k" : 1,
      "debug_info" : "300",
      "top" : "300",
      "dst_h" : 28,
      "dst_w" : 28,
      "type" : "tile"
    },
    {
      "bottom" : "300,x",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.46",
      "top" : "input.46",
      "type" : "elementwise",
      "name" : "input.46",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.47",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.49",
      "blob_weights" : 59,
      "K" : 32,
      "blob_biases" : 57,
      "name" : "input.47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.46",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.50",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "out",
      "blob_weights" : 63,
      "K" : 32,
      "blob_biases" : 61,
      "name" : "input.50",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.49",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.46,out",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.51",
      "top" : "input.51",
      "type" : "elementwise",
      "name" : "input.51",
      "beta" : 0
    },
    {
      "bottom" : "input.51",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.52",
      "top" : "input.52",
      "type" : "activation",
      "name" : "input.52"
    },
    {
      "pad_r" : 0,
      "debug_info" : "d.1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 28,
      "is_global" : 1,
      "top" : "d.1",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "d.1",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.52",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 28,
      "pad_value" : 0
    },
    {
      "name" : "d",
      "weights" : {

      },
      "dst_w" : 32,
      "version" : 1,
      "dst_n" : 1,
      "dst_nd_rank" : 2,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "dynamic_shape" : false,
      "bottom" : "d.1",
      "debug_info" : "d",
      "dst_k" : 1,
      "dst_seq" : 1,
      "top" : "d"
    },
    {
      "nB" : 32,
      "top" : "input",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 67,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "d",
      "blob_biases" : 65,
      "has_tanh" : 0,
      "debug_info" : "input",
      "name" : "input",
      "has_prelu" : 0
    },
    {
      "bottom" : "input",
      "weights" : {

      },
      "nd_axis" : 1,
      "debug_info" : "337",
      "top" : "319",
      "type" : "softmax_nd",
      "name" : "337",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}