<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>AFaceNet.mlmodelc/analytics/coremldata.bin</key>
		<data>
		o6+FbtVi/L+2Kupd+kaj1IFH0KI=
		</data>
		<key>AFaceNet.mlmodelc/coremldata.bin</key>
		<data>
		0OC9hyNhFdMrTImGPzjvaIxJu5A=
		</data>
		<key>AFaceNet.mlmodelc/metadata.json</key>
		<data>
		E1qxFizVMKE6v9UVtzGDUbtg/6I=
		</data>
		<key>AFaceNet.mlmodelc/model.espresso.net</key>
		<data>
		kmGgbhX/K5GLk6FQsMXUlZTy0EE=
		</data>
		<key>AFaceNet.mlmodelc/model.espresso.shape</key>
		<data>
		FQGJhwWD273K2JI++q43aZ5c3HI=
		</data>
		<key>AFaceNet.mlmodelc/model.espresso.weights</key>
		<data>
		822HX5PrIVjCr0cr876jHX3ecTA=
		</data>
		<key>AFaceNet.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>AFaceNet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>AFaceNetM.mlmodelc/analytics/coremldata.bin</key>
		<data>
		PJWtb+ep5HTK73hNxvhFuSkk6eo=
		</data>
		<key>AFaceNetM.mlmodelc/coremldata.bin</key>
		<data>
		KeooL5huZ85HwDbkzffG/T0LhmQ=
		</data>
		<key>AFaceNetM.mlmodelc/metadata.json</key>
		<data>
		mYxH/o3iQ0QBbVdm5Je1DDzgguk=
		</data>
		<key>AFaceNetM.mlmodelc/model.espresso.net</key>
		<data>
		8KIj4YkdaLJ2XiIn7iq5BQfarDU=
		</data>
		<key>AFaceNetM.mlmodelc/model.espresso.shape</key>
		<data>
		fj/w2CHtuYGjJ/6fCoihsRf620U=
		</data>
		<key>AFaceNetM.mlmodelc/model.espresso.weights</key>
		<data>
		zNxL2Nd/UJ9NBI/RfLU2XmKwPns=
		</data>
		<key>AFaceNetM.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>AFaceNetM.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>AntiSpoofingViewController.nib</key>
		<data>
		G+vnF0PiUj3gwEj3NcsLnJr1l0A=
		</data>
		<key>CLASSettingsViewController.nib</key>
		<data>
		H9WqqrKSXXuZ5xPUtas4iGhdkEI=
		</data>
		<key>FA.mlmodelc/analytics/coremldata.bin</key>
		<data>
		CGQq3QHMOsZXQEq78PF9At4jZLU=
		</data>
		<key>FA.mlmodelc/coremldata.bin</key>
		<data>
		P3GlrWP9/lSZ6vayDcGne5jZdXU=
		</data>
		<key>FA.mlmodelc/metadata.json</key>
		<data>
		YtTuNAB0xIwRirPmcmladaficuU=
		</data>
		<key>FA.mlmodelc/model.espresso.net</key>
		<data>
		zvyVPlRoTRP/RMKIbbnQrPBrOPE=
		</data>
		<key>FA.mlmodelc/model.espresso.shape</key>
		<data>
		a9wT1OFlDOx+NsH073K+6fGF624=
		</data>
		<key>FA.mlmodelc/model.espresso.weights</key>
		<data>
		NMXokKQjYOUa07KdW9w1evwW1iQ=
		</data>
		<key>FA.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>FA.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>FE.mlmodelc/analytics/coremldata.bin</key>
		<data>
		K+T9cPss1nYkGWXYqdoendXlLyI=
		</data>
		<key>FE.mlmodelc/coremldata.bin</key>
		<data>
		t3y9MFYO7rPpaCN9NrYWd54R7kM=
		</data>
		<key>FE.mlmodelc/metadata.json</key>
		<data>
		Mw6KiQ42D/8FjhkcLPumrKR0nOs=
		</data>
		<key>FE.mlmodelc/model.espresso.net</key>
		<data>
		2CtbsSOUnen4HRNZBHXZ4IlV7wQ=
		</data>
		<key>FE.mlmodelc/model.espresso.shape</key>
		<data>
		nV4w7oKC65LbJtaEqb3ssqHnEIs=
		</data>
		<key>FE.mlmodelc/model.espresso.weights</key>
		<data>
		7ph7Ohc98W5pwOGpp86Jb9QR4Rc=
		</data>
		<key>FE.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>FE.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>H3.mlmodelc/analytics/coremldata.bin</key>
		<data>
		F3EfFQbwIyGl9OE2zJHABGyUjAY=
		</data>
		<key>H3.mlmodelc/coremldata.bin</key>
		<data>
		0OC9hyNhFdMrTImGPzjvaIxJu5A=
		</data>
		<key>H3.mlmodelc/metadata.json</key>
		<data>
		0k4dU2210Z96LCA74wPKcTYjKxk=
		</data>
		<key>H3.mlmodelc/model.espresso.net</key>
		<data>
		1gbMBFiA5RD69hwhTRMxvFxqFfo=
		</data>
		<key>H3.mlmodelc/model.espresso.shape</key>
		<data>
		Kj011nUXo3jeWfD1wYKuEVR/BKU=
		</data>
		<key>H3.mlmodelc/model.espresso.weights</key>
		<data>
		Z+T1EtfptH7EjmcjtylB5+oCGLE=
		</data>
		<key>H3.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>H3.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>H5.mlmodelc/analytics/coremldata.bin</key>
		<data>
		0lQnEMrAxyMZt6FbUaA5ED6+duc=
		</data>
		<key>H5.mlmodelc/coremldata.bin</key>
		<data>
		eSmF7ArYJMJrRppN+9cIfN6NrZI=
		</data>
		<key>H5.mlmodelc/metadata.json</key>
		<data>
		vDjJyviy17Gd+sIUj3ZYMVh5g08=
		</data>
		<key>H5.mlmodelc/model.espresso.net</key>
		<data>
		T1Ttwdsh5XLY41/wVwLtZ3zd8og=
		</data>
		<key>H5.mlmodelc/model.espresso.shape</key>
		<data>
		wXxYar4Oax33xL8UID20RBEnXuI=
		</data>
		<key>H5.mlmodelc/model.espresso.weights</key>
		<data>
		jaajxIKoqoLv/rTfDPk4rf+J8HU=
		</data>
		<key>H5.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>H5.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Headers/AntiSpoofingDef.h</key>
		<data>
		Nmlh5qAF9JnJ2bLOGnH42lxdcOM=
		</data>
		<key>Headers/AntiSpoofingManager.h</key>
		<data>
		+aTV8oJGZ8pPQscbtVvBcbynwOc=
		</data>
		<key>Headers/AntiSpoofingViewController.h</key>
		<data>
		QL3cpS2DfFXYX2WYExcdqcZ55EM=
		</data>
		<key>Headers/FMBaseEnum.h</key>
		<data>
		wxYh0UiRp2M0dTisHQze3Fkuplg=
		</data>
		<key>Headers/FMBaseObject.h</key>
		<data>
		JU/LY7fEPNROqBVYc3vYr2O4dQQ=
		</data>
		<key>Headers/FMDataManager.h</key>
		<data>
		A3eXH+SQ3UYtv0FLeDHZi8Ad53g=
		</data>
		<key>Headers/FMDataManagerEnum.h</key>
		<data>
		SBfkq+H4TeM327n2xktj9K9+RLw=
		</data>
		<key>Headers/FMDataManagerObject.h</key>
		<data>
		J/+9usse6xwPDzznqojose2XUcc=
		</data>
		<key>Headers/FMECardRecognizer.h</key>
		<data>
		6Goff6iZIVnhYp0AwdwVlj4+O1I=
		</data>
		<key>Headers/FMECardRecognizerEnum.h</key>
		<data>
		x9NGrlLng1oR1xfpfSvOfXZ6Uy4=
		</data>
		<key>Headers/FMECardRecognizerObject.h</key>
		<data>
		wAtH1K5iqw57UVa65RkQyH5svI4=
		</data>
		<key>Headers/FMEPassportRecognizer.h</key>
		<data>
		SWZyppDP1cwEiHEOYBwzROKp4Po=
		</data>
		<key>Headers/FMEPassportRecognizerEnum.h</key>
		<data>
		/+fu8j08VMguBIVCcuXORVgDiDc=
		</data>
		<key>Headers/FMEPassportRecognizerObject.h</key>
		<data>
		hHWpPNysDGEY/ILL/du3ail6+i0=
		</data>
		<key>Headers/FMHelper.h</key>
		<data>
		9A9JxKmzMoEd8G7VvhwQCNTE8Xk=
		</data>
		<key>Headers/FMIDCardRecognizer.h</key>
		<data>
		px50rypOOL1O5w+9rjrxTAeIuv0=
		</data>
		<key>Headers/FMIDCardRecognizerEnum.h</key>
		<data>
		vu6ByacDUEmh4dmzb6I7JA12xvk=
		</data>
		<key>Headers/FMIDCardRecognizerObject.h</key>
		<data>
		aYX3eBcO37ypLf6Wrs/K1jKtw3w=
		</data>
		<key>Headers/FMLicenseManager.h</key>
		<data>
		lFrS5i9Oq957zZ0cnlLBjwsXbsA=
		</data>
		<key>Headers/FMLicenseManagerEnum.h</key>
		<data>
		B9puC/i7fzeJ0G3wuXlLD/RxtoU=
		</data>
		<key>Headers/FMLicenseManagerObject.h</key>
		<data>
		Gt2ateo00g6TB/WpuNYgiKjSAys=
		</data>
		<key>Headers/FMLivenessDetector.h</key>
		<data>
		YT0F7mr+0+TBP+OUOsLW+huw/wI=
		</data>
		<key>Headers/FMLivenessDetectorEnum.h</key>
		<data>
		wkJ05dtKRQdaog8nJksUR52dSYM=
		</data>
		<key>Headers/FMLivenessDetectorObject.h</key>
		<data>
		Lo1JGHcGY+Ba9JwOsYDvzfrf3Po=
		</data>
		<key>Headers/FMLocalizedKey.h</key>
		<data>
		49an88+PhgDv0TtP2XgEaJFUkTc=
		</data>
		<key>Headers/FMQualityDetector.h</key>
		<data>
		S+whCYMlLcUxM4V5YNCU2ve/5B8=
		</data>
		<key>Headers/FMQualityDetectorEnum.h</key>
		<data>
		h2+NerNZj9q9rnAKGRWHtJT7KNw=
		</data>
		<key>Headers/FMQualityDetectorObject.h</key>
		<data>
		shcDnjsCwW4DTzmUbnMdJtnlPio=
		</data>
		<key>Headers/FMRecognizer.h</key>
		<data>
		ERqdrwIOTZ6pz06TdVoJWARTm7s=
		</data>
		<key>Headers/FMRecognizerEnum.h</key>
		<data>
		B2Ei00l8zQ5B88jlVQ5dVOfNKj8=
		</data>
		<key>Headers/FMRecognizerObject.h</key>
		<data>
		PhInsxilH0Z+xg4l6MG7FYd30dg=
		</data>
		<key>Headers/FMSpeechBaseEnum.h</key>
		<data>
		rk7o1STumxWqXQ+px7hRhoYW2d0=
		</data>
		<key>Headers/FMSpeechBaseObject.h</key>
		<data>
		wofEVZLI45HKIgBnVHmMTy9MEjI=
		</data>
		<key>Headers/FMSpeechRecognizer.h</key>
		<data>
		q271f/8YWMiDvEtMXURAW+e91ks=
		</data>
		<key>Headers/FMSpeechRecognizerEnum.h</key>
		<data>
		637Uzc2ZUzoEZwZxACNQ8PpFYx8=
		</data>
		<key>Headers/FMSpeechRecognizerObject.h</key>
		<data>
		O0b5w5Pm4lCgwa95/l+vRTiVCw0=
		</data>
		<key>Headers/FMUserActionDetector.h</key>
		<data>
		jmfVLK5pJObfKvSuveHUjA5ql9o=
		</data>
		<key>Headers/FMUserActionDetectorEnum.h</key>
		<data>
		VcSSr2SobReivaKO3FoMdZESnI4=
		</data>
		<key>Headers/FMUserActionDetectorObject.h</key>
		<data>
		BrG+Qn9NMBWFJNXd4lrhlzGWg2Q=
		</data>
		<key>Info.plist</key>
		<data>
		/PqMA0xCPGiB+zNufRAziJUvd10=
		</data>
		<key>License/licenses.txt</key>
		<data>
		lnnHwCL6R/jhIlq2mNI71spQPeg=
		</data>
		<key>MFaceNet.mlmodelc/analytics/coremldata.bin</key>
		<data>
		Cubza6p25Yzhgb+6XOUPll3VLD0=
		</data>
		<key>MFaceNet.mlmodelc/coremldata.bin</key>
		<data>
		6yraMhKwsvCEwSLU+FmgLTVsGEw=
		</data>
		<key>MFaceNet.mlmodelc/metadata.json</key>
		<data>
		0rahPWxtKj3pfbxXqwv7b6jEAvE=
		</data>
		<key>MFaceNet.mlmodelc/model.espresso.net</key>
		<data>
		lv60kMRs/J4kxmBNsOwuQZsBQw0=
		</data>
		<key>MFaceNet.mlmodelc/model.espresso.shape</key>
		<data>
		2WpIuTGoEJDPufZXI4PhRppWjFM=
		</data>
		<key>MFaceNet.mlmodelc/model.espresso.weights</key>
		<data>
		b8nyOfdLahLojQ5/sBxmsDZz5Xc=
		</data>
		<key>MFaceNet.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>MFaceNet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>MFaceNetAsian.mlmodelc/analytics/coremldata.bin</key>
		<data>
		gRh68eqX85/XB2f0szg9e8fUUIE=
		</data>
		<key>MFaceNetAsian.mlmodelc/coremldata.bin</key>
		<data>
		6yraMhKwsvCEwSLU+FmgLTVsGEw=
		</data>
		<key>MFaceNetAsian.mlmodelc/metadata.json</key>
		<data>
		N05Nf9ERKhVqYQSYumUHtRFfKqE=
		</data>
		<key>MFaceNetAsian.mlmodelc/model.espresso.net</key>
		<data>
		lv60kMRs/J4kxmBNsOwuQZsBQw0=
		</data>
		<key>MFaceNetAsian.mlmodelc/model.espresso.shape</key>
		<data>
		2WpIuTGoEJDPufZXI4PhRppWjFM=
		</data>
		<key>MFaceNetAsian.mlmodelc/model.espresso.weights</key>
		<data>
		lVA6IiUi6WSofNFTP5wi1EMLS7w=
		</data>
		<key>MFaceNetAsian.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>MFaceNetAsian.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>UH5.mlmodelc/analytics/coremldata.bin</key>
		<data>
		5Ndauzw7x/Z+o9Rg/YZQdx9R2Mg=
		</data>
		<key>UH5.mlmodelc/coremldata.bin</key>
		<data>
		TCmB5GGNLzSZhX6muG6NxKJ1M6A=
		</data>
		<key>UH5.mlmodelc/metadata.json</key>
		<data>
		Z8U6tVI+pzcXaBr5RRahbscy+gM=
		</data>
		<key>UH5.mlmodelc/model.espresso.net</key>
		<data>
		gkBFy48Rjh4z6u9o98sJLwt9YQI=
		</data>
		<key>UH5.mlmodelc/model.espresso.shape</key>
		<data>
		CSifSnRYVue+QkFef4wPyzhzSjA=
		</data>
		<key>UH5.mlmodelc/model.espresso.weights</key>
		<data>
		o1Myb9meI8TwfgsfVlDg5Yx+EC0=
		</data>
		<key>UH5.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>UH5.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>VH5.mlmodelc/analytics/coremldata.bin</key>
		<data>
		JDzlmCoVG9cQzETULR1Td5xMcdg=
		</data>
		<key>VH5.mlmodelc/coremldata.bin</key>
		<data>
		eSmF7ArYJMJrRppN+9cIfN6NrZI=
		</data>
		<key>VH5.mlmodelc/metadata.json</key>
		<data>
		IqmQGpYMRuMXSY7KuRUZO//LOYA=
		</data>
		<key>VH5.mlmodelc/model.espresso.net</key>
		<data>
		bKPsvUaf8JLnd03VcGUjepDhXUM=
		</data>
		<key>VH5.mlmodelc/model.espresso.shape</key>
		<data>
		Cx+827I2J0BZGXRWjn3vI8SUeog=
		</data>
		<key>VH5.mlmodelc/model.espresso.weights</key>
		<data>
		uWDNKDEo2rcC/BXzJ5x5uEiZ5+E=
		</data>
		<key>VH5.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>VH5.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>comodel/CoreML/0_3/TextDetector.mlmodel</key>
		<data>
		H/eqJOzE++CcRqpUt1jkE3grZFY=
		</data>
		<key>comodel/CoreML/0_3/TextRecognizer.mlmodel</key>
		<data>
		3m/5S7yBqUkyFoLwmcKhHHwlq58=
		</data>
		<key>comodel/CoreML/0_3/TextRecognizer_s.mlmodel</key>
		<data>
		WbWDo/Prc5mdbiPAxwGrK72bNF0=
		</data>
		<key>comodel/CoreML/0_3/dictionary.txt</key>
		<data>
		9NPerXGJHJfm6/nA7zPslMfWDy4=
		</data>
		<key>comodel/CoreML/0_3/dictionary_s.txt</key>
		<data>
		MdON0d23fCbG+7lKpcHDeu0q3G4=
		</data>
		<key>comodel/CoreML/1_3/TextRecognizer.mlmodel</key>
		<data>
		fBEoj8W65haJ4G0irkBIDvzXenM=
		</data>
		<key>comodel/CoreML/1_3/dictionary.txt</key>
		<data>
		jgAku9Z07gQ2XdFuCn42u5RhUuE=
		</data>
		<key>cvmodel/CoreML/DigitRecognizer/DigitRecognizer_0_1.mlmodel</key>
		<data>
		xbA4bsMfnVRput7UHA75dS0VOfI=
		</data>
		<key>cvmodel/CoreML/DigitRecognizer/DigitRecognizer_1_1.mlmodel</key>
		<data>
		GCeMdwuH86TzL+PPeFlpfP9y/xY=
		</data>
		<key>cvmodel/CoreML/SpeakerVerification/SpeakerVerification_0_1.mlmodel</key>
		<data>
		MX3UGPHF3C2TN44+dfDE4VocvGM=
		</data>
		<key>en.lproj/Localizable.strings</key>
		<dict>
			<key>hash</key>
			<data>
			4PjiZRLHQlgrcHtkTaEZjWZI8hg=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_alert_env_dark.wav</key>
		<dict>
			<key>hash</key>
			<data>
			gPNgEsg03SfvrKw6V96nzFD1zU0=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_center_your_face.wav</key>
		<dict>
			<key>hash</key>
			<data>
			E5snkWl2QUG8SFDzeRWdHMdBLUs=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_face_come_closer.wav</key>
		<dict>
			<key>hash</key>
			<data>
			sm4Xb8L2fzIqF38nlP5XuuJEqXE=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_face_go_farther.wav</key>
		<dict>
			<key>hash</key>
			<data>
			AmamfSYyzrRuS+Os89AKB0KOcIA=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_nod_head.wav</key>
		<dict>
			<key>hash</key>
			<data>
			s9VJv1xnaN9l/jteB4YDSK6VNro=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_ok.wav</key>
		<dict>
			<key>hash</key>
			<data>
			d7ro0eaNSY1xrNwlnB+nc+33CKc=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_processing.wav</key>
		<dict>
			<key>hash</key>
			<data>
			385wm4dinH2IOauB6iHYPvFa0cM=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_smile.wav</key>
		<dict>
			<key>hash</key>
			<data>
			FkOZYhqOcN1igXzz7rM5x/vVkIY=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_turn_left.wav</key>
		<dict>
			<key>hash</key>
			<data>
			GwCkEKB81B9RsVjuMuAjqVWx7ss=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>en.lproj/fm_2das_turn_right.wav</key>
		<dict>
			<key>hash</key>
			<data>
			x1JeFb4npwdWDrISTS+hIaz2TLg=
			</data>
			<key>optional</key>
			<true/>
		</dict>
		<key>erfmodel.mlmodelc/analytics/coremldata.bin</key>
		<data>
		G2lRY6rdIlQszVhy2jwmJBMs4vE=
		</data>
		<key>erfmodel.mlmodelc/coremldata.bin</key>
		<data>
		si62GR0bGHqVwmAB2rM4NxBGWAM=
		</data>
		<key>erfmodel.mlmodelc/metadata.json</key>
		<data>
		hJKt2MDOuJ9CDs51P1uD3VitFn8=
		</data>
		<key>erfmodel.mlmodelc/model.espresso.net</key>
		<data>
		mB1EJFP7+w+lg6Tnk0cSZRE83OY=
		</data>
		<key>erfmodel.mlmodelc/model.espresso.shape</key>
		<data>
		ev1J9GRyj29ReEmkLtLKagAP/Js=
		</data>
		<key>erfmodel.mlmodelc/model.espresso.weights</key>
		<data>
		f8v4llVa7GsEC/+kSthnPiLbn/s=
		</data>
		<key>erfmodel.mlmodelc/model/coremldata.bin</key>
		<data>
		BkTdb7SLF0rndwIJtmwhQ5c6GWM=
		</data>
		<key>erfmodel.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>eye_model.mlmodelc/analytics/coremldata.bin</key>
		<data>
		Ns9On+VgTAIOPgjSMkyCq0S0tZI=
		</data>
		<key>eye_model.mlmodelc/coremldata.bin</key>
		<data>
		UyXslgVN/k+BLhg4q1bZUsHzvw8=
		</data>
		<key>eye_model.mlmodelc/metadata.json</key>
		<data>
		Ja2768zCuxmsGzn3bNBn2iYJXDU=
		</data>
		<key>eye_model.mlmodelc/model.espresso.net</key>
		<data>
		esEWAeMOb4PSWFi7i9UF/4g+etc=
		</data>
		<key>eye_model.mlmodelc/model.espresso.shape</key>
		<data>
		qLBR4wtcpLEe3f8ephukck45a7g=
		</data>
		<key>eye_model.mlmodelc/model.espresso.weights</key>
		<data>
		HvnJUJq2kNy5e0Zxl8ZGHI3SNtU=
		</data>
		<key>eye_model.mlmodelc/model/coremldata.bin</key>
		<data>
		ssdu6OE4uWvkAWuX664GQ2FVnGE=
		</data>
		<key>eye_model.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>fg.mlmodelc/analytics/coremldata.bin</key>
		<data>
		UdGR/N2mSutVfcX4Dq7kE32fKyw=
		</data>
		<key>fg.mlmodelc/coremldata.bin</key>
		<data>
		vKg7IkrlGKegQg2t/kx2GJSrmAk=
		</data>
		<key>fg.mlmodelc/metadata.json</key>
		<data>
		i/DJqjAflUOMxhWuGptpg9Pcoq4=
		</data>
		<key>fg.mlmodelc/model.espresso.net</key>
		<data>
		U7youbtRtzOmTI72cVFHGBuhLDU=
		</data>
		<key>fg.mlmodelc/model.espresso.shape</key>
		<data>
		nLmjG+oL1TpuyGvIJAMGFHosUe4=
		</data>
		<key>fg.mlmodelc/model.espresso.weights</key>
		<data>
		+bAAeoYzZ+aQaLzIlOhtA/4gstU=
		</data>
		<key>fg.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>fg.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>fm_ic_as_alert.png</key>
		<data>
		psOMXaSsix9fNIOQsOMsf5ucUq0=
		</data>
		<key>fm_ic_as_face_left_arrow.png</key>
		<data>
		lulCUcs3N0POT9Uvdp9ZNH52xTM=
		</data>
		<key>fm_ic_as_face_right_arrow.png</key>
		<data>
		5ictR86q7oHBvWCv+1/wX0yba/g=
		</data>
		<key>fm_ic_as_step_dot_finish.png</key>
		<data>
		2kCay8nt8XL6XaYX6PsagSt+k7M=
		</data>
		<key>fm_ic_as_step_dot_ing.png</key>
		<data>
		fK4wBy5zGzi5j/6fzAaxd2QpVwc=
		</data>
		<key>fm_ic_as_step_dot_remain.png</key>
		<data>
		C6ZQy7YLr5Ln1VW8oTmQx8OmCW4=
		</data>
		<key>fm_ic_as_ua_blink.png</key>
		<data>
		5DnIJ1o7cjeySnLJrt8qGskmpk0=
		</data>
		<key>fm_ic_as_ua_nod.png</key>
		<data>
		1ZTCqyq+ypyyvnk9SyxyZ2N1dPM=
		</data>
		<key>fm_ic_as_ua_normal.png</key>
		<data>
		vv5u8Px3Ee21Ite+sPylVGD2V6g=
		</data>
		<key>fm_ic_as_ua_smile.png</key>
		<data>
		ioNHrWAE0S9FB7vd9NuD16Zgn+Y=
		</data>
		<key>fm_ic_as_ua_smile2.png</key>
		<data>
		YjgL/ZphzgLSGxNU9q5n/YNMpXE=
		</data>
		<key>fm_ic_as_ua_turn_left.png</key>
		<data>
		Y8UJGSMnSGnavg98DH78js2HuV0=
		</data>
		<key>fm_ic_as_ua_turn_right.png</key>
		<data>
		2gkw5F+bbJ1BfgHN+10S6PxDVk4=
		</data>
		<key>fmd.mlmodelc/analytics/coremldata.bin</key>
		<data>
		m8Dt+dwBp6cG/+QwliD3AVS9IXY=
		</data>
		<key>fmd.mlmodelc/coremldata.bin</key>
		<data>
		SKHEaNjj8qqyR3U5dIB2iVT553Q=
		</data>
		<key>fmd.mlmodelc/metadata.json</key>
		<data>
		9tqk3y8whc81l2HKdJV35VQFDHw=
		</data>
		<key>fmd.mlmodelc/model.espresso.net</key>
		<data>
		SX3/DJw0RiFYaNSnlsQNf/jNvJA=
		</data>
		<key>fmd.mlmodelc/model.espresso.shape</key>
		<data>
		wYDPFCiK+VS3TVjVJjNz2k1xVIs=
		</data>
		<key>fmd.mlmodelc/model.espresso.weights</key>
		<data>
		8lYKklTkHL+IFK+BDGBg12uvA4c=
		</data>
		<key>fmd.mlmodelc/model/coremldata.bin</key>
		<data>
		vjEQ25itLk4J6CNJPzNbwpxYrSk=
		</data>
		<key>fmd.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>fsa.mlmodelc/analytics/coremldata.bin</key>
		<data>
		ZWhkoleCOQXOkHNMGJxnmpYBZRc=
		</data>
		<key>fsa.mlmodelc/coremldata.bin</key>
		<data>
		yZw3PD+PBvFR6I7mYORxwtkePG4=
		</data>
		<key>fsa.mlmodelc/metadata.json</key>
		<data>
		UfsFDFQtNeocBrl4hr2GWvtScJA=
		</data>
		<key>fsa.mlmodelc/model.espresso.net</key>
		<data>
		Uf3uH5NrvcbE6Y2yYbIG41ymYMk=
		</data>
		<key>fsa.mlmodelc/model.espresso.shape</key>
		<data>
		c3cDvfthGg2cEbj8kkztmzoRblA=
		</data>
		<key>fsa.mlmodelc/model.espresso.weights</key>
		<data>
		nV+0SPQXcrGXxbj1JSFDDmkoUpU=
		</data>
		<key>fsa.mlmodelc/model/coremldata.bin</key>
		<data>
		gojdfG8CuVTDjDFM67RY0ZM58Ac=
		</data>
		<key>fsa.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>h6.mlmodelc/analytics/coremldata.bin</key>
		<data>
		+cGO3mqhUKFP3Mkabsmy8BkNof8=
		</data>
		<key>h6.mlmodelc/coremldata.bin</key>
		<data>
		eSmF7ArYJMJrRppN+9cIfN6NrZI=
		</data>
		<key>h6.mlmodelc/metadata.json</key>
		<data>
		n/a4RvvNzIkvWFHfTbCgIF8Qew0=
		</data>
		<key>h6.mlmodelc/model.espresso.net</key>
		<data>
		T1Ttwdsh5XLY41/wVwLtZ3zd8og=
		</data>
		<key>h6.mlmodelc/model.espresso.shape</key>
		<data>
		wXxYar4Oax33xL8UID20RBEnXuI=
		</data>
		<key>h6.mlmodelc/model.espresso.weights</key>
		<data>
		FQ2SqT5jdSnjUDhQ0hnydTDv6bk=
		</data>
		<key>h6.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>h6.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>iOS_3das_coreml.mlmodelc/analytics/coremldata.bin</key>
		<data>
		XjsO6R+R3qHdZvvtUx6MLrYaxw8=
		</data>
		<key>iOS_3das_coreml.mlmodelc/coremldata.bin</key>
		<data>
		IDW/JAGe70Y8eISJ4F3X89Fi3vc=
		</data>
		<key>iOS_3das_coreml.mlmodelc/metadata.json</key>
		<data>
		92QkTLfs3OrhBfdSyM7LN/lFrJI=
		</data>
		<key>iOS_3das_coreml.mlmodelc/model.espresso.net</key>
		<data>
		ByaY6zF0apc9As6JKqmMYh2QbVQ=
		</data>
		<key>iOS_3das_coreml.mlmodelc/model.espresso.shape</key>
		<data>
		h1UodAW52d3RwCtdd1LamMcl1kI=
		</data>
		<key>iOS_3das_coreml.mlmodelc/model.espresso.weights</key>
		<data>
		hb05xtF4Gn5YL56m537ymTEmUPE=
		</data>
		<key>iOS_3das_coreml.mlmodelc/model.rank.info.json</key>
		<data>
		G9jOKPMHXIaZBopGKOvWZJFbSho=
		</data>
		<key>iOS_3das_coreml.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>iOS_3das_coreml.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>ic_app_icon.png</key>
		<data>
		zRdPj/QOxNV2a5/PcSvML4jXUT8=
		</data>
		<key>icon_pointer@1x.png</key>
		<data>
		bwaD3vHqcGu0lrTjCqabsztZzCA=
		</data>
		<key>icon_pointer@2x.png</key>
		<data>
		+riVKdLyjxTmMeqKxf9dASleXg4=
		</data>
		<key>icon_pointer@3x.png</key>
		<data>
		obqQ3MG10iikkmRJiK6Fr/BnsOc=
		</data>
		<key>lmk3.mlmodelc/analytics/coremldata.bin</key>
		<data>
		9pP5VPZhkMdqjtmnghsay85x9nc=
		</data>
		<key>lmk3.mlmodelc/coremldata.bin</key>
		<data>
		91Tbt7gv+tNJLALEFzDNpO83sz8=
		</data>
		<key>lmk3.mlmodelc/metadata.json</key>
		<data>
		LY+oVBOoxD1kwea0/rS3FNrYJkc=
		</data>
		<key>lmk3.mlmodelc/model.espresso.net</key>
		<data>
		zDV6FSoLlqMZ8Ykck/xCpwGb2J0=
		</data>
		<key>lmk3.mlmodelc/model.espresso.shape</key>
		<data>
		egC/ptZDccDMvQV9c2XFgtFEfwU=
		</data>
		<key>lmk3.mlmodelc/model.espresso.weights</key>
		<data>
		7IoknmjMLj++mPcIAi/KM8fFpUg=
		</data>
		<key>lmk3.mlmodelc/model/coremldata.bin</key>
		<data>
		vjEQ25itLk4J6CNJPzNbwpxYrSk=
		</data>
		<key>lmk3.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>mfsa.mlmodelc/analytics/coremldata.bin</key>
		<data>
		0DpVdNjUFk+PNQHp4U86REUze0Q=
		</data>
		<key>mfsa.mlmodelc/coremldata.bin</key>
		<data>
		Asooht8xxCPTfaR+igrkluzsbTo=
		</data>
		<key>mfsa.mlmodelc/metadata.json</key>
		<data>
		ACJV3w2F8JmfIbzFXibeuRrZOVg=
		</data>
		<key>mfsa.mlmodelc/model.espresso.net</key>
		<data>
		HKG99G4GBSmm3xFbXKdqVb54BYs=
		</data>
		<key>mfsa.mlmodelc/model.espresso.shape</key>
		<data>
		tiSYrFWSQsy3FIFTPMA6ll+3neE=
		</data>
		<key>mfsa.mlmodelc/model.espresso.weights</key>
		<data>
		jifbBKsBSFN2ZGyZFGkHn8yf5Gc=
		</data>
		<key>mfsa.mlmodelc/model/coremldata.bin</key>
		<data>
		gojdfG8CuVTDjDFM67RY0ZM58Ac=
		</data>
		<key>mfsa.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>model/ada_face/Davinci.cade</key>
		<data>
		bWrGnCm9b+ithu7PlLDN3XK57w4=
		</data>
		<key>model/ada_face/LBFFaceShape.regressor</key>
		<data>
		cwoZCvjSlA11zCvHyd1pKMTeOTY=
		</data>
		<key>model/ada_face/LBFFaceShape_fast.regressor</key>
		<data>
		/e8++EtN36Unn9UIauMtmIS8BjI=
		</data>
		<key>model/ada_face/Venus.regressor</key>
		<data>
		JSIoQypbdqHHC2xlIxaUQd08jAw=
		</data>
		<key>model/anti_spoofing/FNNDetector/fnn_v1_7_210819.nn.bin</key>
		<data>
		4/WQN3nUULXCjzFEHUEK6VjQgII=
		</data>
		<key>model/anti_spoofing/FNNDetector/fnn_v1_7_210819.nn.param.bin</key>
		<data>
		CKSr9KGSyR4sSrEV57EweWz2IH8=
		</data>
		<key>model/anti_spoofing/NDetector/Liveness.nn.bin</key>
		<data>
		RtS5J6mJAKpkzmlMkvwEv2XDQRs=
		</data>
		<key>model/anti_spoofing/NDetector/Liveness.nn.param.bin</key>
		<data>
		4HSsa59iY8Uf23NDZ2hEqncOxqQ=
		</data>
		<key>model/anti_spoofing/NDetector/Spoofing.nn.bin</key>
		<data>
		lw+TWsDySAViSB2tTEZ7bu1p9JI=
		</data>
		<key>model/anti_spoofing/NDetector/Spoofing.nn.param.bin</key>
		<data>
		4HSsa59iY8Uf23NDZ2hEqncOxqQ=
		</data>
		<key>model/anti_spoofing/RNDetector/rn_default.nn.bin</key>
		<data>
		IaVX+/KYuIOEY8GdxzRtJkcWKbI=
		</data>
		<key>model/anti_spoofing/RNDetector/rn_default.nn.param.bin</key>
		<data>
		YID53/aPTKFdBxna3fI3wyDM7fQ=
		</data>
		<key>model/common/FaceAttr.json</key>
		<data>
		5+DaEm4Ilazs7nDvW4EDgP93Rf0=
		</data>
		<key>model/coreml/face_attr/FA/FA.json</key>
		<data>
		3CKYFaL5Vtq4LwksQvQf0iasPLc=
		</data>
		<key>model/coreml/face_attr/FE/FE.json</key>
		<data>
		H5HpCxD0ZWQ3sVAd6y9KAde4oT8=
		</data>
		<key>model/coreml/face_attr/FaceAttr.json</key>
		<data>
		txCG7fHEj81IJii3IjXEliyM76Q=
		</data>
		<key>model/coreml/face_attr/H1/FaceAttr.json</key>
		<data>
		d1N5SsSg+66b5G1jnxMAlzCW/CQ=
		</data>
		<key>model/coreml/face_attr/H2/FaceAttr.json</key>
		<data>
		wfC5fMShAFNUmzEQ0mmh1PvKcP0=
		</data>
		<key>model/coreml/face_attr/H3/FaceAttr.json</key>
		<data>
		qMInqlRzRIW38AXcLGw8RRZw6j4=
		</data>
		<key>model/coreml/face_attr/VH/FaceAttr.json</key>
		<data>
		mCTo+VK61VLX8i2Wxy9PWbAIfTw=
		</data>
		<key>model/coreml/face_detection/DNN/Detect.json</key>
		<data>
		alCeo322F6TnqgTDy9QV8sVpL8M=
		</data>
		<key>model/coreml/facial_stat/FacialStat.json</key>
		<data>
		HzCiSDnk10SC2H1MCCFK2SDLgZ0=
		</data>
		<key>model/das/ipad/inner_model</key>
		<data>
		1kmrQA+EYdTj4NABrFuzflSW+jc=
		</data>
		<key>model/das/ipad/whole_model</key>
		<data>
		0lMgELMZ5sjeaL4fEMfHFym9AqI=
		</data>
		<key>model/das/iphone/inner_model</key>
		<data>
		cgRoUFgn1zV5IjcqXflY+qp+yb4=
		</data>
		<key>model/das/iphone/whole_model</key>
		<data>
		l23Ok/CoKrSfV0rciis4SIzQxtI=
		</data>
		<key>model/das_model_desc.json</key>
		<data>
		kMUveJkA1v275PIAHJcmMZCe6uo=
		</data>
		<key>model/face_feature_threshold/model_threshold.json</key>
		<data>
		lt7xvpXBN7yqgHd6xC9wIBo9N0U=
		</data>
		<key>model/id_anti_spoofing/CLIDForgeryDetector2/CLIDForgeryDetector2_model.nn.bin</key>
		<data>
		p0+pvzUfmSXkQB8TrRFxa24LVGo=
		</data>
		<key>model/id_anti_spoofing/CLIDForgeryDetector2/CLIDForgeryDetector2_model.nn.param.bin</key>
		<data>
		3u7cI9yiE12bf53t335IcmJDjL4=
		</data>
		<key>model/model.json</key>
		<data>
		9udMysj6XNwg5WSne553OORdVws=
		</data>
		<key>model/pose/pitch_model</key>
		<data>
		T9hhcGnbcl4snt8qUmzHl82McfI=
		</data>
		<key>model/pose/roll_model</key>
		<data>
		LtRQPLVjPQhux9x/AQvaZTBLbjQ=
		</data>
		<key>model/pose/yaw_model</key>
		<data>
		NZiN4/QQzacJgQavGN2p5Bxh84E=
		</data>
		<key>model/rf/F/UI/tree0.dot</key>
		<data>
		Amfheaps6AKxnUTMYxh+tdcN4EE=
		</data>
		<key>model/rf/F/UI/tree1.dot</key>
		<data>
		hkvBvdyaMGaz5Wh7ogIPw2CKxNI=
		</data>
		<key>model/rf/F/UI/tree2.dot</key>
		<data>
		xKS1PGOXcP7wCsmuVtSOTX3+Kis=
		</data>
		<key>model/rf/F/UI/tree3.dot</key>
		<data>
		hghBEg3hJ6IHaAEazbvnVMzk1Ts=
		</data>
		<key>model/rf/F/UI/tree4.dot</key>
		<data>
		QNNNb6eEtlJ/869cOcuLqIRsJ9g=
		</data>
		<key>model/rf/F/WOUI/tree0.dot</key>
		<data>
		Amfheaps6AKxnUTMYxh+tdcN4EE=
		</data>
		<key>model/rf/F/WOUI/tree1.dot</key>
		<data>
		hkvBvdyaMGaz5Wh7ogIPw2CKxNI=
		</data>
		<key>model/rf/F/WOUI/tree2.dot</key>
		<data>
		xKS1PGOXcP7wCsmuVtSOTX3+Kis=
		</data>
		<key>model/rf/F/WOUI/tree3.dot</key>
		<data>
		hghBEg3hJ6IHaAEazbvnVMzk1Ts=
		</data>
		<key>model/rf/F/WOUI/tree4.dot</key>
		<data>
		QNNNb6eEtlJ/869cOcuLqIRsJ9g=
		</data>
		<key>model/rf/F_M/WOUI/tree0.dot</key>
		<data>
		klKJcOpzTi/53xxle96QyYAh31I=
		</data>
		<key>model/rf/F_M/WOUI/tree1.dot</key>
		<data>
		jHfiC7Qg3dUWVbB3HuX0EUnUhck=
		</data>
		<key>model/rf/F_M/WOUI/tree2.dot</key>
		<data>
		K7W4d0Ees8vfHlSI5nv+8vBvWrU=
		</data>
		<key>model/rf/F_M/WOUI/tree3.dot</key>
		<data>
		9qNiNmpqlEltBG36MgQ+5otzyP0=
		</data>
		<key>model/rf/F_M/WOUI/tree4.dot</key>
		<data>
		oBz4PgHNFFTfR2ojBTq1crJZBBY=
		</data>
		<key>model/rf/H/UI/tree0.dot</key>
		<data>
		bnmU6W+f38dhkuCh3tY7IR5lK3Y=
		</data>
		<key>model/rf/H/UI/tree1.dot</key>
		<data>
		Dxy4iid9OwFvHOobkgiY/O6HHEA=
		</data>
		<key>model/rf/H/UI/tree2.dot</key>
		<data>
		V03g6Uw5gHC3elf0iLssP2YCqyg=
		</data>
		<key>model/rf/H/UI/tree3.dot</key>
		<data>
		sJv4L3JfGsmEx43gQU6yEBHl/2Y=
		</data>
		<key>model/rf/H/UI/tree4.dot</key>
		<data>
		JIU+T+9MB9rtQpDbnYkg/s6ZK3c=
		</data>
		<key>model/rf/H/WOUI/tree0.dot</key>
		<data>
		bnmU6W+f38dhkuCh3tY7IR5lK3Y=
		</data>
		<key>model/rf/H/WOUI/tree1.dot</key>
		<data>
		Dxy4iid9OwFvHOobkgiY/O6HHEA=
		</data>
		<key>model/rf/H/WOUI/tree2.dot</key>
		<data>
		V03g6Uw5gHC3elf0iLssP2YCqyg=
		</data>
		<key>model/rf/H/WOUI/tree3.dot</key>
		<data>
		sJv4L3JfGsmEx43gQU6yEBHl/2Y=
		</data>
		<key>model/rf/H/WOUI/tree4.dot</key>
		<data>
		JIU+T+9MB9rtQpDbnYkg/s6ZK3c=
		</data>
		<key>model/rf/S/UI/tree0.dot</key>
		<data>
		A5xjExx3r3lFsyQ/TapVQ2ihx/s=
		</data>
		<key>model/rf/S/UI/tree1.dot</key>
		<data>
		otjqgn3t4RnZUefvIL00lk4kKgs=
		</data>
		<key>model/rf/S/UI/tree2.dot</key>
		<data>
		MjIUWjISz5q441NqMVswqplVUGo=
		</data>
		<key>model/rf/S/UI/tree3.dot</key>
		<data>
		ZJhRhc6DDxwzxJTQXL2W39DVW6w=
		</data>
		<key>model/rf/S/UI/tree4.dot</key>
		<data>
		gJUl7J8fH4i3HduEKWqOU++c5is=
		</data>
		<key>model/rf/S/WOUI/tree0.dot</key>
		<data>
		A5xjExx3r3lFsyQ/TapVQ2ihx/s=
		</data>
		<key>model/rf/S/WOUI/tree1.dot</key>
		<data>
		otjqgn3t4RnZUefvIL00lk4kKgs=
		</data>
		<key>model/rf/S/WOUI/tree2.dot</key>
		<data>
		MjIUWjISz5q441NqMVswqplVUGo=
		</data>
		<key>model/rf/S/WOUI/tree3.dot</key>
		<data>
		ZJhRhc6DDxwzxJTQXL2W39DVW6w=
		</data>
		<key>model/rf/S/WOUI/tree4.dot</key>
		<data>
		gJUl7J8fH4i3HduEKWqOU++c5is=
		</data>
		<key>model/rf/S_M/WOUI/tree0.dot</key>
		<data>
		rg05o2F9Hc8aCqP1HGcP8bXlcKY=
		</data>
		<key>model/rf/S_M/WOUI/tree1.dot</key>
		<data>
		sRt4+oi+QpP4TVbrDPPy02JsDEE=
		</data>
		<key>model/rf/S_M/WOUI/tree2.dot</key>
		<data>
		rf7Q36YzIrPlftyYDYSIScPe8E8=
		</data>
		<key>model/rf/S_M/WOUI/tree3.dot</key>
		<data>
		vNgjG0+TkwPvYMgr8WSIyHzhqAE=
		</data>
		<key>model/rf/S_M/WOUI/tree4.dot</key>
		<data>
		iFAr3/OVaplzSbpod3SZVcsVnko=
		</data>
		<key>model/y/y.model</key>
		<data>
		pyRCJtbIOaF/x8j9U6aWR6v4Jg4=
		</data>
		<key>mouth_model.mlmodelc/analytics/coremldata.bin</key>
		<data>
		F2TwcAeWr17OUvKtmKG6m1tTVhM=
		</data>
		<key>mouth_model.mlmodelc/coremldata.bin</key>
		<data>
		yoZ6EK1nUyjSQMgMFqozY5wzsvc=
		</data>
		<key>mouth_model.mlmodelc/metadata.json</key>
		<data>
		la9ao8Z+kiI0z3snGJxCWU1t/yo=
		</data>
		<key>mouth_model.mlmodelc/model.espresso.net</key>
		<data>
		hLZWjz4qeBYOWCPLocRpahT+K7E=
		</data>
		<key>mouth_model.mlmodelc/model.espresso.shape</key>
		<data>
		MccYbOBcesIwJvzLgjbm6eUW4Y4=
		</data>
		<key>mouth_model.mlmodelc/model.espresso.weights</key>
		<data>
		p1gwlCZuoyifgJrSwVQcS428JG0=
		</data>
		<key>mouth_model.mlmodelc/model/coremldata.bin</key>
		<data>
		ssdu6OE4uWvkAWuX664GQ2FVnGE=
		</data>
		<key>mouth_model.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>pattern/Landmark/birthday.raw</key>
		<data>
		VkQoezSAusU1GbkvbLoVLBTGEVQ=
		</data>
		<key>pattern/Landmark/cheng.raw</key>
		<data>
		f3+glvq2CT/7gN2M+U0IM7lGwNw=
		</data>
		<key>pattern/Landmark/flag.raw</key>
		<data>
		eQjVN6SAoDK5o+R/8na4VYzoCsk=
		</data>
		<key>pattern/LaserTag/pattern1.raw</key>
		<data>
		1L8ucCWWYylhSbQyCXv1Cx/llAg=
		</data>
		<key>pattern/LaserTag/pattern2.raw</key>
		<data>
		Maz5/ca0ak+6OyB7HgXYKPKZ/Rg=
		</data>
		<key>pattern/LaserTag/pattern3.raw</key>
		<data>
		wu5qfkP/5yT3/hDxRVA7iDs/y/g=
		</data>
		<key>pattern/LaserTag/pattern4.raw</key>
		<data>
		A+03HokJB0WL3OFshBcX2yPp00Q=
		</data>
		<key>pattern/LaserTag/pattern5.raw</key>
		<data>
		zYlBt8E+39DZLsUYkgCkdLvaxfE=
		</data>
		<key>pattern/LaserTag/pattern6.raw</key>
		<data>
		f4fB3sAvRLHclJ7JuqGlrxHvPRQ=
		</data>
		<key>pattern/OVI/OVI_pattern.raw</key>
		<data>
		VSb0ijS9TyA8M1xX+Qu0oV/oxhQ=
		</data>
		<key>rf_m_25.mlmodelc/analytics/coremldata.bin</key>
		<data>
		VJu2laRGk6tC52mPpICP3MxJrBo=
		</data>
		<key>rf_m_25.mlmodelc/coremldata.bin</key>
		<data>
		1QMtTNmTWc89DWzBabdEcbdO3Z4=
		</data>
		<key>rf_m_25.mlmodelc/metadata.json</key>
		<data>
		GUP5svp6qmN/XRkrBV1HtahrJsY=
		</data>
		<key>rf_m_25.mlmodelc/model.espresso.net</key>
		<data>
		NYU/YRf6h1ay38TAjF19VbJIx7A=
		</data>
		<key>rf_m_25.mlmodelc/model.espresso.shape</key>
		<data>
		uR7CXHEv43mNFkUXEOAPikEghyc=
		</data>
		<key>rf_m_25.mlmodelc/model.espresso.weights</key>
		<data>
		gebC8rBHAvQHJgYe0/NC/M2LmHg=
		</data>
		<key>rf_m_25.mlmodelc/model/coremldata.bin</key>
		<data>
		6VWi6JRb9Ai4H32nWvXDA/GPYpU=
		</data>
		<key>rf_m_25.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>vh6.mlmodelc/analytics/coremldata.bin</key>
		<data>
		/uO5TBed5kp2l08iv+UhBmUDxzc=
		</data>
		<key>vh6.mlmodelc/coremldata.bin</key>
		<data>
		KEvpSF3IAKPgaAVpUMgv+3ztrqk=
		</data>
		<key>vh6.mlmodelc/metadata.json</key>
		<data>
		5sKj0xZ43s6mTwQS4r60R5mqRpw=
		</data>
		<key>vh6.mlmodelc/model.espresso.net</key>
		<data>
		sDbqQe4xs0uFd5wo+Lh0Na9+5l4=
		</data>
		<key>vh6.mlmodelc/model.espresso.shape</key>
		<data>
		j+GlWnGuCzmN6/rgw1JMLh2q4/8=
		</data>
		<key>vh6.mlmodelc/model.espresso.weights</key>
		<data>
		vW2D+L4334ExPXaH2J5/SoxOHpY=
		</data>
		<key>vh6.mlmodelc/model/coremldata.bin</key>
		<data>
		tG7D5y5QwkUWM9yDw7ZrVm1dcjE=
		</data>
		<key>vh6.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>vhm2.mlmodelc/analytics/coremldata.bin</key>
		<data>
		E8I/m2S1npltEfvmpzFB2SvSo7s=
		</data>
		<key>vhm2.mlmodelc/coremldata.bin</key>
		<data>
		KeooL5huZ85HwDbkzffG/T0LhmQ=
		</data>
		<key>vhm2.mlmodelc/metadata.json</key>
		<data>
		8Ri75dmPsKsKMKjFVBw8evKNl3s=
		</data>
		<key>vhm2.mlmodelc/model.espresso.net</key>
		<data>
		wi0I50haYJKCHsnUnN1bxEcxNd0=
		</data>
		<key>vhm2.mlmodelc/model.espresso.shape</key>
		<data>
		/KDbVvYBe5mzpe1fqfKB0MLKofQ=
		</data>
		<key>vhm2.mlmodelc/model.espresso.weights</key>
		<data>
		U/U5QjOhulKGqayYzm4Z1iU0GDk=
		</data>
		<key>vhm2.mlmodelc/model/coremldata.bin</key>
		<data>
		HolXxMBoDG4NPzjX2wTDcZCYxiA=
		</data>
		<key>vhm2.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>AFaceNet.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			en7WjOcTmij0dVNIeD4F7i7WSG7t5/00hoqE7fSkzbc=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			0oVOgajHxg7n25Dr5XcIakjhYyuP5N9aeRSg4l7vgAg=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			hJkq5jro7Qovk4UnoPdqcx91/T5DVnBd2qTIfXpwfGk=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			+R5PJkkel3jvk9imInVB4I9NosNr46Pa3Fe+LSifqFo=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			OFqp2yTkWyLRcCkCOZPUFB1GaT56ALEp3bSvfj8cnsg=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			z5JzL+2FLisTpmfNkUiIPhBdPML4Oyfbitl+bLD0K7s=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YKLr4FqgWwhMRVf+dAFkSypFyqXsKsTdvd1aPAl/qrc=
			</data>
		</dict>
		<key>AFaceNet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			oSMJ8kRApumA6HOl9IjKuxMpX6SbaNLCkjGKypw1h6s=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			UDYXBfODWNqOGbrwWmJgiInX3QquQ5Vs8GNn8S/wI5E=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			lY4OGQYMdW69ucoEMHFV4f3Yxj3xmZukv85UtOjk0ng=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			lLmAq73rzFQZnH+FKIo2l69ll406tTwyrzLZLiT7uTc=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			u9VIx1DYH319CMGMBv5iavch7RA+AgncfLdlHmmxPvQ=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			Sd+Gtd2v+m+QWQeolTc36XgW5oLSFAxkPqAY8gikDf0=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YKLr4FqgWwhMRVf+dAFkSypFyqXsKsTdvd1aPAl/qrc=
			</data>
		</dict>
		<key>AFaceNetM.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>AntiSpoofingViewController.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			XOvjqbiHFJGxku0TDva/mnGSi+9hAhEQfvLkDoFu8Qs=
			</data>
		</dict>
		<key>CLASSettingsViewController.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			GboaEVu5+TcdD5gTj0TR8JV+8qZmAEWWcXOD0SyOF8I=
			</data>
		</dict>
		<key>FA.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			hE5NA7Rh7KKZELFIX74GEf0zo75nqp3hRF6LObIEpVc=
			</data>
		</dict>
		<key>FA.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Wgk+h5W2g14Mjczb1G3rt7tLG/CNGbVZPVbpKFFXgnY=
			</data>
		</dict>
		<key>FA.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			yqF3a40p2q0Vl9NmtPnWu3qrYHif18MSld9EFEaBPsE=
			</data>
		</dict>
		<key>FA.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Y61i8khSW4a7eySGfChUVxBHNO+auhe2Fb7m/O8sOCo=
			</data>
		</dict>
		<key>FA.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			uC6yOeTuANiiRPoLeMbxvSfZUguRz2jFvWMOqJWFVEc=
			</data>
		</dict>
		<key>FA.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			nqxAUmTAou28ctkTYKwLl2cMfCfWFwie1WQTF0mIgwQ=
			</data>
		</dict>
		<key>FA.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YKLr4FqgWwhMRVf+dAFkSypFyqXsKsTdvd1aPAl/qrc=
			</data>
		</dict>
		<key>FA.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>FE.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			MCL01ePUEnJuh+vGlPhadviQo0lLnnH6gfewBT1WpUk=
			</data>
		</dict>
		<key>FE.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			hbSAeE+ipWTZ501Za8hV+meaL4D+xd2feC1fUx9TFyw=
			</data>
		</dict>
		<key>FE.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			dQoT6tUqjon27V6d2TNKW2qKJo/XspwfYIgsscu7v3Q=
			</data>
		</dict>
		<key>FE.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			w/TMiXGk/ImREG0Vb07SXwCZ9P5AoWVsjILHMo9TwNU=
			</data>
		</dict>
		<key>FE.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			Zv8+VKz8Wadg7D/L0lEBL5O+yuR/2aN+1+8P5ZHD8tY=
			</data>
		</dict>
		<key>FE.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			PKfa9aA6qrkUi+8auF3yK8+zAhpP9ItSfgBxhpHSP34=
			</data>
		</dict>
		<key>FE.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YKLr4FqgWwhMRVf+dAFkSypFyqXsKsTdvd1aPAl/qrc=
			</data>
		</dict>
		<key>FE.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>H3.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LxtY5gT8vmWFIffWsLEa2ShFuitv/rSUohCpYdtVEFQ=
			</data>
		</dict>
		<key>H3.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			0oVOgajHxg7n25Dr5XcIakjhYyuP5N9aeRSg4l7vgAg=
			</data>
		</dict>
		<key>H3.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			QJnXxwUBIMJ55PhC0g32fMOJXNfxEznEZ0/PedY7OWM=
			</data>
		</dict>
		<key>H3.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			CxNNSRbnGoHGeeyzF6jAsF6L9+U2aLq7AVzzeeNDf+0=
			</data>
		</dict>
		<key>H3.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			2ggz60ZVdFYNTNVttuP2ciHzWXqpTvO7dF0qNcrIAbc=
			</data>
		</dict>
		<key>H3.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			sE3Ahm7GingJocC7MK3CHSzMrG66PiUmnhvxYErBzjM=
			</data>
		</dict>
		<key>H3.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YKLr4FqgWwhMRVf+dAFkSypFyqXsKsTdvd1aPAl/qrc=
			</data>
		</dict>
		<key>H3.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>H5.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			zwNEdtatcWYPkL5GovEpnYvasBNM90xTwigK9yfXwKA=
			</data>
		</dict>
		<key>H5.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			BgxNxdFbchRWieemHZ2Yhm9HmgrFtqI9PqvYakU3B4s=
			</data>
		</dict>
		<key>H5.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			F8F8bYOfogXzmFmlw8d2E9aMn5zLOspZpJP7gnFNB+4=
			</data>
		</dict>
		<key>H5.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			bCU3tk3QeK/GexclbLPMyzVNolOwa6X6gNuRaWVSbpg=
			</data>
		</dict>
		<key>H5.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			ZJcBw9IhMVSp2K0rPKjY6y7Tpzq9mGI1dD089vY0uEM=
			</data>
		</dict>
		<key>H5.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			rLn2pBB8ZYKPm34pp9nRXz2BTBcPIgUf4ypDx7ecN+Y=
			</data>
		</dict>
		<key>H5.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YKLr4FqgWwhMRVf+dAFkSypFyqXsKsTdvd1aPAl/qrc=
			</data>
		</dict>
		<key>H5.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Headers/AntiSpoofingDef.h</key>
		<dict>
			<key>hash2</key>
			<data>
			G+izA8MqqL1HuvkmOSta+5G/2lDQl1kBoVHjGpspp/8=
			</data>
		</dict>
		<key>Headers/AntiSpoofingManager.h</key>
		<dict>
			<key>hash2</key>
			<data>
			lsrN4m3I7keBtM2k/N0Uq83V+AV/EEdaUa0ywQN0dSM=
			</data>
		</dict>
		<key>Headers/AntiSpoofingViewController.h</key>
		<dict>
			<key>hash2</key>
			<data>
			6G9JwrRS94l6RdnMVJH6wVxnfABLhuUJXcTZ+KR/9oQ=
			</data>
		</dict>
		<key>Headers/FMBaseEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			Rg43cfXNHTLPu35dLl2STFOAc7ZhtpjMKTC/bkZiN7E=
			</data>
		</dict>
		<key>Headers/FMBaseObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			cExWl5xWNRyWXdCnT+wwCIzkLOAgYWd+b028vE/VsLg=
			</data>
		</dict>
		<key>Headers/FMDataManager.h</key>
		<dict>
			<key>hash2</key>
			<data>
			0anXYlIGN7RKJDNWiIJw1eaalaqHoNIPoKqNVV1QKq4=
			</data>
		</dict>
		<key>Headers/FMDataManagerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			v7tNWC0D5c2/UY9EmIcmmOaITtYkqiHWOC6hdqhrw+A=
			</data>
		</dict>
		<key>Headers/FMDataManagerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ydhLvV5hl4MfbRV+moMlxQVJkzJoheQhGTyB8+A267I=
			</data>
		</dict>
		<key>Headers/FMECardRecognizer.h</key>
		<dict>
			<key>hash2</key>
			<data>
			1DUxl7N/fdY7Vd36aSfF7juk1Aog5tGwYf+qO1b3GNM=
			</data>
		</dict>
		<key>Headers/FMECardRecognizerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			XWoAd5TSDzEpU0UGZTjUZmfZmbLr//8x0MC8hspAoXM=
			</data>
		</dict>
		<key>Headers/FMECardRecognizerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			TaXGMSR/Oec+htvpg9LX1Cyb+e1dja9F9+hRLJZgYLQ=
			</data>
		</dict>
		<key>Headers/FMEPassportRecognizer.h</key>
		<dict>
			<key>hash2</key>
			<data>
			AAhppll2LcdAjD6913lr6gs9IXGYoPHQdbh15DICg4s=
			</data>
		</dict>
		<key>Headers/FMEPassportRecognizerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			FfhKX591XAjqjBSW78FOku8kLsyjI750SmYgU/IheLw=
			</data>
		</dict>
		<key>Headers/FMEPassportRecognizerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			OjZBHMhUuUPoiz/g3SnDQzJ++TQ+w+eQNOhrjK3QzE4=
			</data>
		</dict>
		<key>Headers/FMHelper.h</key>
		<dict>
			<key>hash2</key>
			<data>
			tW7JW31LTvxQbBLDA3EcvoK1tfp0+qUor1X8Ah8wLzk=
			</data>
		</dict>
		<key>Headers/FMIDCardRecognizer.h</key>
		<dict>
			<key>hash2</key>
			<data>
			pQUgpAqphWZb9mKjspsIPJWy+mZanULNu8/rowzMGuY=
			</data>
		</dict>
		<key>Headers/FMIDCardRecognizerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			FeGGW+e9d1TpssUT1LmGUoe2q9N30gKI1cqVt7BAN6Y=
			</data>
		</dict>
		<key>Headers/FMIDCardRecognizerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			K8onA/GpKBc1NAfIjtpYBdL9sC+s6zafS9oeQN/i768=
			</data>
		</dict>
		<key>Headers/FMLicenseManager.h</key>
		<dict>
			<key>hash2</key>
			<data>
			1sO0i5SAyvBzTpgRFL3ZjscSm/+9GgfpDKpkj/lGMRw=
			</data>
		</dict>
		<key>Headers/FMLicenseManagerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ZyJMmTfWTGdO7kY/5KNn0dJoVQmcwJAZ2DoUshEFmLo=
			</data>
		</dict>
		<key>Headers/FMLicenseManagerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			fbPOgTOzK62BrrPn4QXrqccGu60A4nUAXLVGhwS9xRs=
			</data>
		</dict>
		<key>Headers/FMLivenessDetector.h</key>
		<dict>
			<key>hash2</key>
			<data>
			SkUwMNMu29PttFdfffqbbtYvqL6rG+Z8DK1lISuH0+U=
			</data>
		</dict>
		<key>Headers/FMLivenessDetectorEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			tReM2mDSItvW+iFnGVIc1KKxRC98Ft7CqF5rEtt7H4k=
			</data>
		</dict>
		<key>Headers/FMLivenessDetectorObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			f8ASTItkRS+AIrtmwlwYjf/DoH1DEP8owjQpUwnkLhc=
			</data>
		</dict>
		<key>Headers/FMLocalizedKey.h</key>
		<dict>
			<key>hash2</key>
			<data>
			E1XjbMjdTPCZy4WuqFCbu3CKxpBUfNC2DzKHPAIkiPw=
			</data>
		</dict>
		<key>Headers/FMQualityDetector.h</key>
		<dict>
			<key>hash2</key>
			<data>
			y6Oj12OJ6hHXAO4sKOqLmtjhIDK+eaOo5a4LUGTQwPQ=
			</data>
		</dict>
		<key>Headers/FMQualityDetectorEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ZlXjQfUF6osTsvPBIuRK+83aMWNjPfja1jwafzj4MzY=
			</data>
		</dict>
		<key>Headers/FMQualityDetectorObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			K4TEjl8Du11v/vufOYZaaW8T2nROUrgmc32KO5pvXsY=
			</data>
		</dict>
		<key>Headers/FMRecognizer.h</key>
		<dict>
			<key>hash2</key>
			<data>
			O2371luKiV1qCzV1lGI/b2qrJTkC1SEHUkkk7sVoDz0=
			</data>
		</dict>
		<key>Headers/FMRecognizerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			2HbARM5QaA35aNk8jZbqQGsEgn3YU6+eGMN4pPLPm3E=
			</data>
		</dict>
		<key>Headers/FMRecognizerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			HC79XKQ6bvG/0RTqm4kMlDaKxdfZQqdKXTKAA7/D1kA=
			</data>
		</dict>
		<key>Headers/FMSpeechBaseEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ou3+qn/e5Pw/bBB9KyhGRUvLyZgakW0AJ/jtkiCymxw=
			</data>
		</dict>
		<key>Headers/FMSpeechBaseObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			tKb5j6LCP34QYNVjzCkVbovRzK0jYYkrqCGOMnyyz7Y=
			</data>
		</dict>
		<key>Headers/FMSpeechRecognizer.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ZYpxSPY4VNt9AKPUvL6IPGN2hPuEjZZk+wN7AGSiXlQ=
			</data>
		</dict>
		<key>Headers/FMSpeechRecognizerEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			jHeL7vrdgDB2UHMWofaHFH7Rm6U1lRhk5ps45wpjVWQ=
			</data>
		</dict>
		<key>Headers/FMSpeechRecognizerObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			ep6Izde6dLI7ciHCOkFbORCjbgUqsMUc0QrLNvKXUMg=
			</data>
		</dict>
		<key>Headers/FMUserActionDetector.h</key>
		<dict>
			<key>hash2</key>
			<data>
			3L4NR12zhOm4Nnsnf2P0j9pquiICmtdB8/PJT8yFYgA=
			</data>
		</dict>
		<key>Headers/FMUserActionDetectorEnum.h</key>
		<dict>
			<key>hash2</key>
			<data>
			SeXpH1qmwG/t2JzTVeSrT3GAfU+HN5ihVENYqoT1454=
			</data>
		</dict>
		<key>Headers/FMUserActionDetectorObject.h</key>
		<dict>
			<key>hash2</key>
			<data>
			gat7BpSvoQz4DeuKuC9HME2kCL0V776LRoH2eKDOOV8=
			</data>
		</dict>
		<key>License/licenses.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			JDzemBRlY5I0vjmFEw2b0ALw4VQzMbsnnvoqoOMV/zs=
			</data>
		</dict>
		<key>MFaceNet.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			kjxbj8MspXGBMoClK6TqyfGRvyP3iV0vvagRAVod8RQ=
			</data>
		</dict>
		<key>MFaceNet.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsltxFGEXJK1EwAqH2r5qHo4LpehZUNPGvMKWu6qNHU=
			</data>
		</dict>
		<key>MFaceNet.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			15izJ5+zA6CIwNNOVMB87OVfPRM6kzBbXkPp7M04iN4=
			</data>
		</dict>
		<key>MFaceNet.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			6IAi1uE8A9xd5ym74jOXRgmyt7m2y3AkwEwz5cMp42s=
			</data>
		</dict>
		<key>MFaceNet.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
